#include "sprites.h"
#include "bitPatterns.h"

#define TWO(a, b, c, d) a, b, (c << 4) + d
#define ONE(a, b) a, (b << 4)


// clang-format off

const unsigned char shape_FRAME_02[] = {

    26,
    3,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT0 ),                      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 05   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 06   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 07   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 08   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 09   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( _XXXXXX_, HMT0 ),                      // 10   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _X____X_, HMT0 ),                      // 11   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( __XXXX__, HMT0 ),                      // 13   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 14   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( X_XXXX_X, HMT0 ),                      // 15   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 16   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX____XX, HMT0 ),                      // 17   |🟩🟩◼️◼️◼️◼️🟩🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 18   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 19   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X______X, HMT0 ),                      // 20   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( __XXXX__, HMT0 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 24   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 25   |◼️◼️🟩◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_03[] = {

    27,
    3,
    0,
                                                //      +-------------+
    ONE( ___XXX__, HMT0 ),                      // 00   |◼️◼️◼️🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT0 ),                      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( _XXXX_XX, HMT0 ),                      // 05   |◼️🟩🟩🟩🟩◼️🟩🟩|
    ONE( _XXXX_XX, HMT0 ),                      // 06   |◼️🟩🟩🟩🟩◼️🟩🟩|
    ONE( _XXXX_XX, HMT0 ),                      // 07   |◼️🟩🟩🟩🟩◼️🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 08   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 09   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( _____XXX, HMT0 ),                      // 10   |◼️◼️◼️◼️◼️🟩🟩🟩|
    ONE( _XXXX_X_, HMT0 ),                      // 11   |◼️🟩🟩🟩🟩◼️🟩◼️|
    ONE( _XXXXX__, HMT0 ),                      // 12   |◼️🟩🟩🟩🟩🟩◼️◼️|
    ONE( X____X__, HMT0 ),                      // 13   |🟩◼️◼️◼️◼️🟩◼️◼️|
    ONE( XXXXX___, HMT0 ),                      // 14   |🟩🟩🟩🟩🟩◼️◼️◼️|
    ONE( XXXXX_X_, HMT0 ),                      // 15   |🟩🟩🟩🟩🟩◼️🟩◼️|
    ONE( ______X_, HMT0 ),                      // 16   |◼️◼️◼️◼️◼️◼️🟩◼️|
    ONE( _XXXX_X_, HMT0 ),                      // 17   |◼️🟩🟩🟩🟩◼️🟩◼️|
    ONE( _XXXXX__, HMT0 ),                      // 18   |◼️🟩🟩🟩🟩🟩◼️◼️|
    ONE( ___X____, HMT0 ),                      // 19   |◼️◼️◼️🟩◼️◼️◼️◼️|
    ONE( __X_X___, HMT0 ),                      // 20   |◼️◼️🟩◼️🟩◼️◼️◼️|
    ONE( _XXX_X__, HMT0 ),                      // 21   |◼️🟩🟩🟩◼️🟩◼️◼️|
    ONE( _XX__X__, HMT0 ),                      // 22   |◼️🟩🟩◼️◼️🟩◼️◼️|
    ONE( _XX_____, HMT0 ),                      // 23   |◼️🟩🟩◼️◼️◼️◼️◼️|
    ONE( __X_____, HMT0 ),                      // 24   |◼️◼️🟩◼️◼️◼️◼️◼️|
    ONE( ________, HMT0 ),                      // 25   |◼️◼️◼️◼️◼️◼️◼️◼️|
    ONE( ________, HMT0 ),                      // 26   |◼️◼️◼️◼️◼️◼️◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_05[] = {

    27,
    4,
    0,
                                                //      +-------------+
    ONE( __XXX___, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩◼️◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT0 ),                      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX_XXXX_, HMT0 ),                      // 05   |🟩🟩◼️🟩🟩🟩🟩◼️|
    ONE( XX_XXXX_, HMT0 ),                      // 06   |🟩🟩◼️🟩🟩🟩🟩◼️|
    ONE( XX_XXXX_, HMT0 ),                      // 07   |🟩🟩◼️🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT0 ),                      // 08   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 09   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXX_____, HMT0 ),                      // 10   |🟩🟩🟩◼️◼️◼️◼️◼️|
    ONE( _X_XXXX_, HMT0 ),                      // 11   |◼️🟩◼️🟩🟩🟩🟩◼️|
    ONE( __XXXXX_, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩🟩◼️|
    ONE( __X____X, HMT0 ),                      // 13   |◼️◼️🟩◼️◼️◼️◼️🟩|
    ONE( ___XXXXX, HMT0 ),                      // 14   |◼️◼️◼️🟩🟩🟩🟩🟩|
    ONE( _X_XXXXX, HMT0 ),                      // 15   |◼️🟩◼️🟩🟩🟩🟩🟩|
    ONE( _X______, HMT0 ),                      // 16   |◼️🟩◼️◼️◼️◼️◼️◼️|
    ONE( _X_XXXX_, HMT0 ),                      // 17   |◼️🟩◼️🟩🟩🟩🟩◼️|
    ONE( __XXXXX_, HMT0 ),                      // 18   |◼️◼️🟩🟩🟩🟩🟩◼️|
    ONE( ____X___, HMT0 ),                      // 19   |◼️◼️◼️◼️🟩◼️◼️◼️|
    ONE( ___X_X__, HMT0 ),                      // 20   |◼️◼️◼️🟩◼️🟩◼️◼️|
    ONE( __X_XXX_, HMT0 ),                      // 21   |◼️◼️🟩◼️🟩🟩🟩◼️|
    ONE( __X__XX_, HMT0 ),                      // 22   |◼️◼️🟩◼️◼️🟩🟩◼️|
    ONE( _____XX_, HMT0 ),                      // 23   |◼️◼️◼️◼️◼️🟩🟩◼️|
    ONE( _____X__, HMT0 ),                      // 24   |◼️◼️◼️◼️◼️🟩◼️◼️|
    ONE( ________, HMT0 ),                      // 25   |◼️◼️◼️◼️◼️◼️◼️◼️|
    ONE( ________, HMT0 ),                      // 26   |◼️◼️◼️◼️◼️◼️◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_06[] = {

    26,
    0,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXX_XX, HMT0 ),                      // 03   |🟩🟩🟩🟩🟩◼️🟩🟩|
    ONE( XXXX___X, HMT0 ),                      // 04   |🟩🟩🟩🟩◼️◼️◼️🟩|
    ONE( XX_X_X_X, HMT0 ),                      // 05   |🟩🟩◼️🟩◼️🟩◼️🟩|
    ONE( XX_X_X_X, HMT0 ),                      // 06   |🟩🟩◼️🟩◼️🟩◼️🟩|
    ONE( XX_X___X, HMT0 ),                      // 07   |🟩🟩◼️🟩◼️◼️◼️🟩|
    ONE( XXXX___X, HMT0 ),                      // 08   |🟩🟩🟩🟩◼️◼️◼️🟩|
    ONE( XXXX___X, HMT0 ),                      // 09   |🟩🟩🟩🟩◼️◼️◼️🟩|
    ONE( _XXXX_X_, HMT0 ),                      // 10   |◼️🟩🟩🟩🟩◼️🟩◼️|
    ONE( _XXXX_X_, HMT0 ),                      // 11   |◼️🟩🟩🟩🟩◼️🟩◼️|
    ONE( X_XXXX__, HMT0 ),                      // 12   |🟩◼️🟩🟩🟩🟩◼️◼️|
    ONE( XX______, HMT0 ),                      // 13   |🟩🟩◼️◼️◼️◼️◼️◼️|
    ONE( X_XX_X__, HMT0 ),                      // 14   |🟩◼️🟩🟩◼️🟩◼️◼️|
    ONE( X_XX_X__, HMT0 ),                      // 15   |🟩◼️🟩🟩◼️🟩◼️◼️|
    ONE( XXXX_X__, HMT0 ),                      // 16   |🟩🟩🟩🟩◼️🟩◼️◼️|
    ONE( X_XX____, HMT0 ),                      // 17   |🟩◼️🟩🟩◼️◼️◼️◼️|
    ONE( X_XX_X__, HMT0 ),                      // 18   |🟩◼️🟩🟩◼️🟩◼️◼️|
    ONE( X_XX_X__, HMT0 ),                      // 19   |🟩◼️🟩🟩◼️🟩◼️◼️|
    ONE( X_X_X___, HMT0 ),                      // 20   |🟩◼️🟩◼️🟩◼️◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 21   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __XX____, HMT0 ),                      // 23   |◼️◼️🟩🟩◼️◼️◼️◼️|
    ONE( __XX____, HMT0 ),                      // 24   |◼️◼️🟩🟩◼️◼️◼️◼️|
    ONE( __XXX___, HMT0 ),                      // 25   |◼️◼️🟩🟩🟩◼️◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_07[] = {

    27,
    0,
    0,
                                                //      +-------------+
    ONE( ___XXX__, HMT0 ),                      // 00   |◼️◼️◼️🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXX_XX, HMT0 ),                      // 03   |🟩🟩🟩🟩🟩◼️🟩🟩|
    ONE( XXXXX__X, HMT0 ),                      // 04   |🟩🟩🟩🟩🟩◼️◼️🟩|
    ONE( XXX_X_XX, HMT0 ),                      // 05   |🟩🟩🟩◼️🟩◼️🟩🟩|
    ONE( XXX_X_XX, HMT0 ),                      // 06   |🟩🟩🟩◼️🟩◼️🟩🟩|
    ONE( XXX_X__X, HMT0 ),                      // 07   |🟩🟩🟩◼️🟩◼️◼️🟩|
    ONE( XXXXX__X, HMT0 ),                      // 08   |🟩🟩🟩🟩🟩◼️◼️🟩|
    ONE( XXXXX__X, HMT0 ),                      // 09   |🟩🟩🟩🟩🟩◼️◼️🟩|
    ONE( _XXXX_X_, HMT0 ),                      // 10   |◼️🟩🟩🟩🟩◼️🟩◼️|
    ONE( _XXXX_X_, HMT0 ),                      // 11   |◼️🟩🟩🟩🟩◼️🟩◼️|
    ONE( __X_XX__, HMT0 ),                      // 12   |◼️◼️🟩◼️🟩🟩◼️◼️|
    ONE( XX___XX_, HMT0 ),                      // 13   |🟩🟩◼️◼️◼️🟩🟩◼️|
    ONE( XX_XXXX_, HMT0 ),                      // 14   |🟩🟩◼️🟩🟩🟩🟩◼️|
    ONE( XX_XXXX_, HMT0 ),                      // 15   |🟩🟩◼️🟩🟩🟩🟩◼️|
    ONE( XXX_XX__, HMT0 ),                      // 16   |🟩🟩🟩◼️🟩🟩◼️◼️|
    ONE( X_XX____, HMT0 ),                      // 17   |🟩◼️🟩🟩◼️◼️◼️◼️|
    ONE( _X______, HMT0 ),                      // 18   |◼️🟩◼️◼️◼️◼️◼️◼️|
    ONE( _X_XXX_X, HMT0 ),                      // 19   |◼️🟩◼️🟩🟩🟩◼️🟩|
    ONE( XXXX_XXX, HMT0 ),                      // 20   |🟩🟩🟩🟩◼️🟩🟩🟩|
    ONE( XXX__XXX, HMT0 ),                      // 21   |🟩🟩🟩◼️◼️🟩🟩🟩|
    ONE( X_X___X_, HMT0 ),                      // 22   |🟩◼️🟩◼️◼️◼️🟩◼️|
    ONE( ______X_, HMT0 ),                      // 23   |◼️◼️◼️◼️◼️◼️🟩◼️|
    ONE( ________, HMT0 ),                      // 24   |◼️◼️◼️◼️◼️◼️◼️◼️|
    ONE( ________, HMT0 ),                      // 25   |◼️◼️◼️◼️◼️◼️◼️◼️|
    ONE( ________, HMT0 ),                      // 26   |◼️◼️◼️◼️◼️◼️◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_08[] = {

    26,
    0,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXX_XX, HMT0 ),                      // 03   |🟩🟩🟩🟩🟩◼️🟩🟩|
    ONE( XXXX___X, HMT0 ),                      // 04   |🟩🟩🟩🟩◼️◼️◼️🟩|
    ONE( XX_X_X_X, HMT0 ),                      // 05   |🟩🟩◼️🟩◼️🟩◼️🟩|
    ONE( XX_X_X_X, HMT0 ),                      // 06   |🟩🟩◼️🟩◼️🟩◼️🟩|
    ONE( XX_X___X, HMT0 ),                      // 07   |🟩🟩◼️🟩◼️◼️◼️🟩|
    ONE( XXXX___X, HMT0 ),                      // 08   |🟩🟩🟩🟩◼️◼️◼️🟩|
    ONE( XXXX___X, HMT0 ),                      // 09   |🟩🟩🟩🟩◼️◼️◼️🟩|
    ONE( _XXXX_X_, HMT0 ),                      // 10   |◼️🟩🟩🟩🟩◼️🟩◼️|
    ONE( _XXXX_X_, HMT0 ),                      // 11   |◼️🟩🟩🟩🟩◼️🟩◼️|
    ONE( X_XXXX__, HMT0 ),                      // 12   |🟩◼️🟩🟩🟩🟩◼️◼️|
    ONE( XX______, HMT0 ),                      // 13   |🟩🟩◼️◼️◼️◼️◼️◼️|
    ONE( X_XX_X__, HMT0 ),                      // 14   |🟩◼️🟩🟩◼️🟩◼️◼️|
    ONE( X_XX_X__, HMT0 ),                      // 15   |🟩◼️🟩🟩◼️🟩◼️◼️|
    ONE( XXXX_X__, HMT0 ),                      // 16   |🟩🟩🟩🟩◼️🟩◼️◼️|
    ONE( X_XX____, HMT0 ),                      // 17   |🟩◼️🟩🟩◼️◼️◼️◼️|
    ONE( X_XX_X__, HMT0 ),                      // 18   |🟩◼️🟩🟩◼️🟩◼️◼️|
    ONE( X_XX_X__, HMT0 ),                      // 19   |🟩◼️🟩🟩◼️🟩◼️◼️|
    ONE( X_X_X___, HMT0 ),                      // 20   |🟩◼️🟩◼️🟩◼️◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 21   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __XX____, HMT0 ),                      // 23   |◼️◼️🟩🟩◼️◼️◼️◼️|
    ONE( __XX____, HMT0 ),                      // 24   |◼️◼️🟩🟩◼️◼️◼️◼️|
    ONE( __XXX___, HMT0 ),                      // 25   |◼️◼️🟩🟩🟩◼️◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_09[] = {

    27,
    0,
    0,
                                                //      +-------------+
    ONE( ___XXX__, HMT0 ),                      // 00   |◼️◼️◼️🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXX__XX, HMT0 ),                      // 03   |🟩🟩🟩🟩◼️◼️🟩🟩|
    ONE( XXX__X_X, HMT0 ),                      // 04   |🟩🟩🟩◼️◼️🟩◼️🟩|
    ONE( X_X_X__X, HMT0 ),                      // 05   |🟩◼️🟩◼️🟩◼️◼️🟩|
    ONE( X_X_X__X, HMT0 ),                      // 06   |🟩◼️🟩◼️🟩◼️◼️🟩|
    ONE( X_X____X, HMT0 ),                      // 07   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( XXX____X, HMT0 ),                      // 08   |🟩🟩🟩◼️◼️◼️◼️🟩|
    ONE( XXX____X, HMT0 ),                      // 09   |🟩🟩🟩◼️◼️◼️◼️🟩|
    ONE( _XXX__X_, HMT0 ),                      // 10   |◼️🟩🟩🟩◼️◼️🟩◼️|
    ONE( _XXX__X_, HMT0 ),                      // 11   |◼️🟩🟩🟩◼️◼️🟩◼️|
    ONE( X_XXXX__, HMT0 ),                      // 12   |🟩◼️🟩🟩🟩🟩◼️◼️|
    ONE( XX_____X, HMT0 ),                      // 13   |🟩🟩◼️◼️◼️◼️◼️🟩|
    ONE( _XXX_X_X, HMT0 ),                      // 14   |◼️🟩🟩🟩◼️🟩◼️🟩|
    ONE( XXXX_X_X, HMT0 ),                      // 15   |🟩🟩🟩🟩◼️🟩◼️🟩|
    ONE( XXXX_X__, HMT0 ),                      // 16   |🟩🟩🟩🟩◼️🟩◼️◼️|
    ONE( _XX_____, HMT0 ),                      // 17   |◼️🟩🟩◼️◼️◼️◼️◼️|
    ONE( _____X__, HMT0 ),                      // 18   |◼️◼️◼️◼️◼️🟩◼️◼️|
    ONE( _X_X_X_X, HMT0 ),                      // 19   |◼️🟩◼️🟩◼️🟩◼️🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 20   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXX_XXX, HMT0 ),                      // 21   |🟩🟩🟩🟩◼️🟩🟩🟩|
    ONE( X_X___X_, HMT0 ),                      // 22   |🟩◼️🟩◼️◼️◼️🟩◼️|
    ONE( ______X_, HMT0 ),                      // 23   |◼️◼️◼️◼️◼️◼️🟩◼️|
    ONE( ________, HMT0 ),                      // 24   |◼️◼️◼️◼️◼️◼️◼️◼️|
    ONE( ________, HMT0 ),                      // 25   |◼️◼️◼️◼️◼️◼️◼️◼️|
    ONE( ________, HMT0 ),                      // 26   |◼️◼️◼️◼️◼️◼️◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_10[] = {

    26,
    0,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT0 ),                      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX_X__XX, HMT0 ),                      // 05   |🟩🟩◼️🟩◼️◼️🟩🟩|
    ONE( XXX___XX, HMT0 ),                      // 06   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( X_X____X, HMT0 ),                      // 07   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 08   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 09   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT0 ),                      // 10   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _X____X_, HMT0 ),                      // 11   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 14   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XX_XX, HMT0 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XX_XX_XX, HMT0 ),                      // 16   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 17   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 18   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_X__X_X, HMT0 ),                      // 19   |🟩◼️🟩◼️◼️🟩◼️🟩|
    ONE( X__XX__X, HMT0 ),                      // 20   |🟩◼️◼️🟩🟩◼️◼️🟩|
    ONE( __XXXX__, HMT0 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 24   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 25   |◼️◼️🟩◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_11[] = {

    27,
    0,
    0,
                                                //      +-------------+
    ONE( __XXX___, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩◼️◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT0 ),                      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX___XXX, HMT0 ),                      // 05   |🟩🟩◼️◼️◼️🟩🟩🟩|
    ONE( X_X__XXX, HMT0 ),                      // 06   |🟩◼️🟩◼️◼️🟩🟩🟩|
    ONE( X_X___XX, HMT0 ),                      // 07   |🟩◼️🟩◼️◼️◼️🟩🟩|
    ONE( X_____XX, HMT0 ),                      // 08   |🟩◼️◼️◼️◼️◼️🟩🟩|
    ONE( X_____XX, HMT0 ),                      // 09   |🟩◼️◼️◼️◼️◼️🟩🟩|
    ONE( _X___XX_, HMT0 ),                      // 10   |◼️🟩◼️◼️◼️🟩🟩◼️|
    ONE( _X___XX_, HMT0 ),                      // 11   |◼️🟩◼️◼️◼️🟩🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ______X_, HMT0 ),                      // 13   |◼️◼️◼️◼️◼️◼️🟩◼️|
    ONE( _XXXXXXX, HMT0 ),                      // 14   |◼️🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX_XX_XX, HMT0 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XX_X_X_X, HMT0 ),                      // 16   |🟩🟩◼️🟩◼️🟩◼️🟩|
    ONE( X_XX_XXX, HMT0 ),                      // 17   |🟩◼️🟩🟩◼️🟩🟩🟩|
    ONE( __XX_XX_, HMT0 ),                      // 18   |◼️◼️🟩🟩◼️🟩🟩◼️|
    ONE( ___X_XX_, HMT0 ),                      // 19   |◼️◼️◼️🟩◼️🟩🟩◼️|
    ONE( __X_X___, HMT0 ),                      // 20   |◼️◼️🟩◼️🟩◼️◼️◼️|
    ONE( _XXX_X__, HMT0 ),                      // 21   |◼️🟩🟩🟩◼️🟩◼️◼️|
    ONE( _XX__X__, HMT0 ),                      // 22   |◼️🟩🟩◼️◼️🟩◼️◼️|
    ONE( _XX_____, HMT0 ),                      // 23   |◼️🟩🟩◼️◼️◼️◼️◼️|
    ONE( __X_____, HMT0 ),                      // 24   |◼️◼️🟩◼️◼️◼️◼️◼️|
    ONE( ________, HMT0 ),                      // 25   |◼️◼️◼️◼️◼️◼️◼️◼️|
    ONE( ________, HMT0 ),                      // 26   |◼️◼️◼️◼️◼️◼️◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_12[] = {

    26,
    0,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT0 ),                      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX_X__XX, HMT0 ),                      // 05   |🟩🟩◼️🟩◼️◼️🟩🟩|
    ONE( XXX___XX, HMT0 ),                      // 06   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( X_X____X, HMT0 ),                      // 07   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 08   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 09   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT0 ),                      // 10   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _X____X_, HMT0 ),                      // 11   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 14   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XX_XX, HMT0 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XX_XX_XX, HMT0 ),                      // 16   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 17   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 18   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_X__X_X, HMT0 ),                      // 19   |🟩◼️🟩◼️◼️🟩◼️🟩|
    ONE( X__XX__X, HMT0 ),                      // 20   |🟩◼️◼️🟩🟩◼️◼️🟩|
    ONE( __XXXX__, HMT0 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 24   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 25   |◼️◼️🟩◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_13[] = {

    27,
    0,
    0,
                                                //      +-------------+
    ONE( ___XXX__, HMT0 ),                      // 00   |◼️◼️◼️🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT0 ),                      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXX___XX, HMT0 ),                      // 05   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( XXXX___X, HMT0 ),                      // 06   |🟩🟩🟩🟩◼️◼️◼️🟩|
    ONE( XX_X___X, HMT0 ),                      // 07   |🟩🟩◼️🟩◼️◼️◼️🟩|
    ONE( XX_____X, HMT0 ),                      // 08   |🟩🟩◼️◼️◼️◼️◼️🟩|
    ONE( XX_____X, HMT0 ),                      // 09   |🟩🟩◼️◼️◼️◼️◼️🟩|
    ONE( _XX___X_, HMT0 ),                      // 10   |◼️🟩🟩◼️◼️◼️🟩◼️|
    ONE( _XX___X_, HMT0 ),                      // 11   |◼️🟩🟩◼️◼️◼️🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X______, HMT0 ),                      // 13   |◼️🟩◼️◼️◼️◼️◼️◼️|
    ONE( XXXXXXX_, HMT0 ),                      // 14   |🟩🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XX_XX, HMT0 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( X_X_X_XX, HMT0 ),                      // 16   |🟩◼️🟩◼️🟩◼️🟩🟩|
    ONE( XXX_XX_X, HMT0 ),                      // 17   |🟩🟩🟩◼️🟩🟩◼️🟩|
    ONE( _XX_XX__, HMT0 ),                      // 18   |◼️🟩🟩◼️🟩🟩◼️◼️|
    ONE( _XX_X___, HMT0 ),                      // 19   |◼️🟩🟩◼️🟩◼️◼️◼️|
    ONE( ___X_X__, HMT0 ),                      // 20   |◼️◼️◼️🟩◼️🟩◼️◼️|
    ONE( __X_XXX_, HMT0 ),                      // 21   |◼️◼️🟩◼️🟩🟩🟩◼️|
    ONE( __X__XX_, HMT0 ),                      // 22   |◼️◼️🟩◼️◼️🟩🟩◼️|
    ONE( _____XX_, HMT0 ),                      // 23   |◼️◼️◼️◼️◼️🟩🟩◼️|
    ONE( _____X__, HMT0 ),                      // 24   |◼️◼️◼️◼️◼️🟩◼️◼️|
    ONE( ________, HMT0 ),                      // 25   |◼️◼️◼️◼️◼️◼️◼️◼️|
    ONE( ________, HMT0 ),                      // 26   |◼️◼️◼️◼️◼️◼️◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_14[] = {

    SPRITE_DOUBLE | 26,
    0,
    0,
                                                //      +---------------------------+
    TWO( ________, _XX_____, HMT0, HMT0 ),      // 00   |◼️◼️◼️◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️|
    TWO( _______X, X_______, HMT0, HMT0 ),      // 01   |◼️◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( __XXXX_X, ________, HMT0, HMT0 ),      // 02   |◼️◼️🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXXXX_, X_______, HMT0, HMT0 ),      // 03   |◼️🟩🟩🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXXXX_, X_______, HMT0, HMT0 ),      // 04   |◼️🟩🟩🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( XXXX__X_, X_______, HMT0, HMT0 ),      // 05   |🟩🟩🟩🟩◼️◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( XXX__X_X, _X______, HMT0, HMT0 ),      // 06   |🟩🟩🟩◼️◼️🟩◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( X_X_X__X, _X______, HMT0, HMT0 ),      // 07   |🟩◼️🟩◼️🟩◼️◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( X_X_X__X, _X______, HMT0, HMT0 ),      // 08   |🟩◼️🟩◼️🟩◼️◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( X_X____X, _X______, HMT0, HMT0 ),      // 09   |🟩◼️🟩◼️◼️◼️◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( XXX____X, ________, HMT0, HMT0 ),      // 10   |🟩🟩🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XXX____X, _X______, HMT0, HMT0 ),      // 11   |🟩🟩🟩◼️◼️◼️◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( _XXX__X_, _X______, HMT0, HMT0 ),      // 12   |◼️🟩🟩🟩◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( _XXX_X_X, ________, HMT0, HMT0 ),      // 13   |◼️🟩🟩🟩◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( X_XXXXXX, ________, HMT0, HMT0 ),      // 14   |🟩◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XX____XX, ________, HMT0, HMT0 ),      // 15   |🟩🟩◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( X_XX_XX_, ________, HMT0, HMT0 ),      // 16   |🟩◼️🟩🟩◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( X_XX_XX_, ________, HMT0, HMT0 ),      // 17   |🟩◼️🟩🟩◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXX___, ________, HMT0, HMT0 ),      // 18   |◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X_XX_X_, ________, HMT0, HMT0 ),      // 19   |◼️🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X_XX_X_, ________, HMT0, HMT0 ),      // 20   |◼️🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X__XX__, ________, HMT0, HMT0 ),      // 21   |◼️🟩◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____XX__, ________, HMT0, HMT0 ),      // 22   |◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____XX__, ________, HMT0, HMT0 ),      // 23   |◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___XX___, ________, HMT0, HMT0 ),      // 24   |◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___XXX__, ________, HMT0, HMT0 ),      // 25   |◼️◼️◼️🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_15[] = {

    SPRITE_DOUBLE | 25,
    0,
    0,
                                                //      +---------------------------+
    TWO( ___XXXX_, ________, HMT0, HMT0 ),      // 00   |◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __XXXXXX, ___XX___, HMT0, HMT0 ),      // 01   |◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️🟩🟩◼️◼️◼️|
    TWO( __XXXXXX, _____X__, HMT0, HMT0 ),      // 02   |◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️🟩◼️◼️|
    TWO( _XXXXX_X, X_____X_, HMT0, HMT0 ),      // 03   |◼️🟩🟩🟩🟩🟩◼️🟩🟩◼️◼️◼️◼️◼️🟩◼️|
    TWO( _XXXX___, X____XX_, HMT0, HMT0 ),      // 04   |◼️🟩🟩🟩🟩◼️◼️◼️🟩◼️◼️◼️◼️🟩🟩◼️|
    TWO( _XX_X_X_, X____X_X, HMT0, HMT0 ),      // 05   |◼️🟩🟩◼️🟩◼️🟩◼️🟩◼️◼️◼️◼️🟩◼️🟩|
    TWO( _XX_X_X_, X___X__X, HMT0, HMT0 ),      // 06   |◼️🟩🟩◼️🟩◼️🟩◼️🟩◼️◼️◼️🟩◼️◼️🟩|
    TWO( _XX_X___, X___X__X, HMT0, HMT0 ),      // 07   |◼️🟩🟩◼️🟩◼️◼️◼️🟩◼️◼️◼️🟩◼️◼️🟩|
    TWO( _XXXX___, X__X____, HMT0, HMT0 ),      // 08   |◼️🟩🟩🟩🟩◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️|
    TWO( _XXXX___, X__X____, HMT0, HMT0 ),      // 09   |◼️🟩🟩🟩🟩◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️|
    TWO( __XXXX_X, __X__X__, HMT0, HMT0 ),      // 10   |◼️◼️🟩🟩🟩🟩◼️🟩◼️◼️🟩◼️◼️🟩◼️◼️|
    TWO( __XXXX_X, __X_____, HMT0, HMT0 ),      // 11   |◼️◼️🟩🟩🟩🟩◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️|
    TWO( _X_XXXX_, _______X, HMT0, HMT0 ),      // 12   |◼️🟩◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️🟩|
    TWO( _XX____X, X______X, HMT0, HMT0 ),      // 13   |◼️🟩🟩◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️🟩|
    TWO( _X_XX_XX, X_______, HMT0, HMT0 ),      // 14   |◼️🟩◼️🟩🟩◼️🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X_XX_XX, ________, HMT0, HMT0 ),      // 15   |◼️🟩◼️🟩🟩◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXX_X_, ________, HMT0, HMT0 ),      // 16   |◼️🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X_XXX__, _____X__, HMT0, HMT0 ),      // 17   |◼️🟩◼️🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️|
    TWO( _X_XX_X_, _____X__, HMT0, HMT0 ),      // 18   |◼️🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️|
    TWO( _X__XX__, ________, HMT0, HMT0 ),      // 19   |◼️🟩◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____XX__, ________, HMT0, HMT0 ),      // 20   |◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____XX__, ________, HMT0, HMT0 ),      // 21   |◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___XX___, ________, HMT0, HMT0 ),      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___XX___, ________, HMT0, HMT0 ),      // 23   |◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____XX__, ________, HMT0, HMT0 ),      // 24   |◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_16[] = {

    SPRITE_DOUBLE | 30,
    0,
    0,
                                                //      +---------------------------+
    TWO( ________, XX______, HMT0, HMT0 ),      // 00   |◼️◼️◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( ______XX, X____X__, HMT0, HMT0 ),      // 01   |◼️◼️◼️◼️◼️◼️🟩🟩🟩◼️◼️◼️◼️🟩◼️◼️|
    TWO( _____X_X, X____X__, HMT0, HMT0 ),      // 02   |◼️◼️◼️◼️◼️🟩◼️🟩🟩◼️◼️◼️◼️🟩◼️◼️|
    TWO( ________, X__X____, HMT0, HMT0 ),      // 03   |◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️|
    TWO( ________, X_______, HMT0, HMT0 ),      // 04   |◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ______XX, XX______, HMT0, HMT0 ),      // 05   |◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( _____XXX, XXX____X, HMT0, HMT0 ),      // 06   |◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️🟩|
    TWO( _____XXX, XXX____X, HMT0, HMT0 ),      // 07   |◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️🟩|
    TWO( ____XXXX, XXXX____, HMT0, HMT0 ),      // 08   |◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️|
    TWO( ____XXXX, XXXX____, HMT0, HMT0 ),      // 09   |◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️|
    TWO( ____X_XX, XX_X____, HMT0, HMT0 ),      // 10   |◼️◼️◼️◼️🟩◼️🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️|
    TWO( ____X_XX, XX_X____, HMT0, HMT0 ),      // 11   |◼️◼️◼️◼️🟩◼️🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️|
    TWO( ____X_XX, XX_X____, HMT0, HMT0 ),      // 12   |◼️◼️◼️◼️🟩◼️🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️|
    TWO( ____XXXX, XXXX____, HMT0, HMT0 ),      // 13   |◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️|
    TWO( ____XXXX, XXXX____, HMT0, HMT0 ),      // 14   |◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️|
    TWO( _____XXX, XXX_____, HMT0, HMT0 ),      // 15   |◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️|
    TWO( ____XX__, __X_____, HMT0, HMT0 ),      // 16   |◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️|
    TWO( ____XXXX, X_______, HMT0, HMT0 ),      // 17   |◼️◼️◼️◼️🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____XXXX, X_______, HMT0, HMT0 ),      // 18   |◼️◼️◼️◼️🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____X___, __X_____, HMT0, HMT0 ),      // 19   |◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️|
    TWO( ____XXXX, X_______, HMT0, HMT0 ),      // 20   |◼️◼️◼️◼️🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( _____XXX, X_X_____, HMT0, HMT0 ),      // 21   |◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️◼️|
    TWO( ________, __X_____, HMT0, HMT0 ),      // 22   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️|
    TWO( _____XXX, X_______, HMT0, HMT0 ),      // 23   |◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ________, ________, HMT0, HMT0 ),      // 24   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ______XX, XX______, HMT0, HMT0 ),      // 25   |◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( _______X, X_______, HMT0, HMT0 ),      // 26   |◼️◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ______X_, _X______, HMT0, HMT0 ),      // 27   |◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( ______X_, _X______, HMT0, HMT0 ),      // 28   |◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( ______X_, _X______, HMT0, HMT0 ),      // 29   |◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_17[] = {

    SPRITE_DOUBLE | 28,
    0,
    0,
                                                //      +---------------------------+
    TWO( __XXXX__, ________, HMT0, HMT0 ),      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXXXX_, ________, HMT0, HMT0 ),      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXXXX_, ________, HMT0, HMT0 ),      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XXXXXXXX, ________, HMT0, HMT0 ),      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XXXXXXXX, ________, HMT0, HMT0 ),      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XXX___XX, ________, HMT0, HMT0 ),      // 05   |🟩🟩🟩◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XXXX___X, ________, HMT0, HMT0 ),      // 06   |🟩🟩🟩🟩◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XX_X___X, ________, HMT0, HMT0 ),      // 07   |🟩🟩◼️🟩◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XX_____X, ________, HMT0, HMT0 ),      // 08   |🟩🟩◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XX_____X, ________, HMT0, HMT0 ),      // 09   |🟩🟩◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XX___X_, ________, HMT0, HMT0 ),      // 10   |◼️🟩🟩◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XX___X_, ________, HMT0, HMT0 ),      // 11   |◼️🟩🟩◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __XXXX__, ________, HMT0, HMT0 ),      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ______X_, ________, HMT0, HMT0 ),      // 13   |◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXXXX_, ________, HMT0, HMT0 ),      // 14   |◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXX__XX, ________, HMT0, HMT0 ),      // 15   |◼️🟩🟩🟩◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X_XX__X, ________, HMT0, HMT0 ),      // 16   |◼️🟩◼️🟩🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __X_XXXX, ________, HMT0, HMT0 ),      // 17   |◼️◼️🟩◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___X_XX_, ________, HMT0, HMT0 ),      // 18   |◼️◼️◼️🟩◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __X____X, ___X____, HMT0, HMT0 ),      // 19   |◼️◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️🟩◼️◼️◼️◼️|
    TWO( _XXXXXXX, X__XX___, HMT0, HMT0 ),      // 20   |◼️🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️🟩🟩◼️◼️◼️|
    TWO( XX_XXX_X, X__XX___, HMT0, HMT0 ),      // 21   |🟩🟩◼️🟩🟩🟩◼️🟩🟩◼️◼️🟩🟩◼️◼️◼️|
    TWO( _X______, _X_X____, HMT0, HMT0 ),      // 22   |◼️🟩◼️◼️◼️◼️◼️◼️◼️🟩◼️🟩◼️◼️◼️◼️|
    TWO( ________, _XX_____, HMT0, HMT0 ),      // 23   |◼️◼️◼️◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️|
    TWO( ________, __X_____, HMT0, HMT0 ),      // 24   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️|
    TWO( ________, _X____X_, HMT0, HMT0 ),      // 25   |◼️◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️🟩◼️|
    TWO( ________, X_____X_, HMT0, HMT0 ),      // 26   |◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️🟩◼️|
    TWO( ________, ________, HMT0, HMT0 ),      // 27   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_18[] = {

    SPRITE_DOUBLE | 29,
    0,
    0,
                                                //      +---------------------------+
    TWO( __XXXX__, ________, HMT0, HMT0 ),      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXXXX_, ________, HMT0, HMT0 ),      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXXXX_, ________, HMT0, HMT0 ),      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXXXX_, ________, HMT0, HMT0 ),      // 03   |◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XXXXXXXX, ________, HMT0, HMT0 ),      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XX_X__XX, ________, HMT0, HMT0 ),      // 05   |🟩🟩◼️🟩◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XXX___XX, ________, HMT0, HMT0 ),      // 06   |🟩🟩🟩◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( X_X____X, ________, HMT0, HMT0 ),      // 07   |🟩◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( X______X, ________, HMT0, HMT0 ),      // 08   |🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( X______X, ________, HMT0, HMT0 ),      // 09   |🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X____X_, ________, HMT0, HMT0 ),      // 10   |◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X____X_, ________, HMT0, HMT0 ),      // 11   |◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __XXXX__, ________, HMT0, HMT0 ),      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ________, ________, HMT0, HMT0 ),      // 13   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXXXX_, ________, HMT0, HMT0 ),      // 14   |◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XX___X_, ________, HMT0, HMT0 ),      // 15   |◼️🟩🟩◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __XX_XX_, ________, HMT0, HMT0 ),      // 16   |◼️◼️🟩🟩◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __XX_XX_, ________, HMT0, HMT0 ),      // 17   |◼️◼️🟩🟩◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___X_X__, ________, HMT0, HMT0 ),      // 18   |◼️◼️◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __X_X_X_, ________, HMT0, HMT0 ),      // 19   |◼️◼️🟩◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXX_XXX, ________, HMT0, HMT0 ),      // 20   |◼️🟩🟩🟩◼️🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XX_X_X_X, X_______, HMT0, HMT0 ),      // 21   |🟩🟩◼️🟩◼️🟩◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X_____X, ________, HMT0, HMT0 ),      // 22   |◼️🟩◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____X___, ________, HMT0, HMT0 ),      // 23   |◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____X___, ________, HMT0, HMT0 ),      // 24   |◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( X___X___, ________, HMT0, HMT0 ),      // 25   |🟩◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____XX_X, ________, HMT0, HMT0 ),      // 26   |◼️◼️◼️◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____XXX_, ________, HMT0, HMT0 ),      // 27   |◼️◼️◼️◼️🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___XX___, ________, HMT0, HMT0 ),      // 28   |◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_19[] = {

    26,
    0,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXX__XXX, HMT0 ),                      // 03   |🟩🟩🟩◼️◼️🟩🟩🟩|
    ONE( XX_X__XX, HMT0 ),                      // 04   |🟩🟩◼️🟩◼️◼️🟩🟩|
    ONE( XXX___XX, HMT0 ),                      // 05   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( X_X____X, HMT0 ),                      // 06   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 07   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 08   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 09   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT0 ),                      // 10   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XX__XX_, HMT0 ),                      // 11   |◼️🟩🟩◼️◼️🟩🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 14   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XX_XX, HMT0 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XX_XX_XX, HMT0 ),                      // 16   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 17   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 18   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_X__X_X, HMT0 ),                      // 19   |🟩◼️🟩◼️◼️🟩◼️🟩|
    ONE( X__XX__X, HMT0 ),                      // 20   |🟩◼️◼️🟩🟩◼️◼️🟩|
    ONE( __XXXX__, HMT0 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 24   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 25   |◼️◼️🟩◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_20[] = {

    26,
    0,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT0 ),                      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXX__XXX, HMT0 ),                      // 04   |🟩🟩🟩◼️◼️🟩🟩🟩|
    ONE( XX_X__XX, HMT0 ),                      // 05   |🟩🟩◼️🟩◼️◼️🟩🟩|
    ONE( XXX___XX, HMT0 ),                      // 06   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( X_X____X, HMT0 ),                      // 07   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 08   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 09   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT0 ),                      // 10   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _X____X_, HMT0 ),                      // 11   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 14   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XX_X_, HMT0 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩◼️|
    ONE( XX_XX_X_, HMT0 ),                      // 16   |🟩🟩◼️🟩🟩◼️🟩◼️|
    ONE( XXXXXXX_, HMT0 ),                      // 17   |🟩🟩🟩🟩🟩🟩🟩◼️|
    ONE( X_XXX_X_, HMT0 ),                      // 18   |🟩◼️🟩🟩🟩◼️🟩◼️|
    ONE( X_X___X_, HMT0 ),                      // 19   |🟩◼️🟩◼️◼️◼️🟩◼️|
    ONE( X__XX_X_, HMT0 ),                      // 20   |🟩◼️◼️🟩🟩◼️🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 24   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 25   |◼️◼️🟩◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_21[] = {

    25,
    0,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT0 ),                      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX_X__XX, HMT0 ),                      // 05   |🟩🟩◼️🟩◼️◼️🟩🟩|
    ONE( XXX___XX, HMT0 ),                      // 06   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( X_X____X, HMT0 ),                      // 07   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 08   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 09   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT0 ),                      // 10   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _X____X_, HMT0 ),                      // 11   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( XXXXX_X_, HMT0 ),                      // 14   |🟩🟩🟩🟩🟩◼️🟩◼️|
    ONE( XX_XX_X_, HMT0 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩◼️|
    ONE( XX____X_, HMT0 ),                      // 16   |🟩🟩◼️◼️◼️◼️🟩◼️|
    ONE( X_X_XXX_, HMT0 ),                      // 17   |🟩◼️🟩◼️🟩🟩🟩◼️|
    ONE( X_X_XX__, HMT0 ),                      // 18   |🟩◼️🟩◼️🟩🟩◼️◼️|
    ONE( ___X____, HMT0 ),                      // 19   |◼️◼️◼️🟩◼️◼️◼️◼️|
    ONE( __XXXX__, HMT0 ),                      // 20   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 21   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 22   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 24   |◼️◼️🟩◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_22[] = {

    26,
    0,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT0 ),                      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXX__XXX, HMT0 ),                      // 04   |🟩🟩🟩◼️◼️🟩🟩🟩|
    ONE( XX_X__XX, HMT0 ),                      // 05   |🟩🟩◼️🟩◼️◼️🟩🟩|
    ONE( XXX___XX, HMT0 ),                      // 06   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( X_X____X, HMT0 ),                      // 07   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 08   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 09   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT0 ),                      // 10   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _X____X_, HMT0 ),                      // 11   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 14   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XX_X_, HMT0 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩◼️|
    ONE( XX_XX_X_, HMT0 ),                      // 16   |🟩🟩◼️🟩🟩◼️🟩◼️|
    ONE( XXXXXXX_, HMT0 ),                      // 17   |🟩🟩🟩🟩🟩🟩🟩◼️|
    ONE( X_XXX_X_, HMT0 ),                      // 18   |🟩◼️🟩🟩🟩◼️🟩◼️|
    ONE( X_X___X_, HMT0 ),                      // 19   |🟩◼️🟩◼️◼️◼️🟩◼️|
    ONE( X__XX_X_, HMT0 ),                      // 20   |🟩◼️◼️🟩🟩◼️🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 24   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 25   |◼️◼️🟩◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_23[] = {

    26,
    0,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXX__XXX, HMT0 ),                      // 03   |🟩🟩🟩◼️◼️🟩🟩🟩|
    ONE( XX_X__XX, HMT0 ),                      // 04   |🟩🟩◼️🟩◼️◼️🟩🟩|
    ONE( XXX___XX, HMT0 ),                      // 05   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( X_X____X, HMT0 ),                      // 06   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 07   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 08   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 09   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT0 ),                      // 10   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XX__XX_, HMT0 ),                      // 11   |◼️🟩🟩◼️◼️🟩🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 14   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XX_XX, HMT0 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XX_XX_XX, HMT0 ),                      // 16   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 17   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 18   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_X__X_X, HMT0 ),                      // 19   |🟩◼️🟩◼️◼️🟩◼️🟩|
    ONE( X__XX__X, HMT0 ),                      // 20   |🟩◼️◼️🟩🟩◼️◼️🟩|
    ONE( __XXXX__, HMT0 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 24   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 25   |◼️◼️🟩◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_24[] = {

    24,
    0,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT0 ),                      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX_X__XX, HMT0 ),                      // 05   |🟩🟩◼️🟩◼️◼️🟩🟩|
    ONE( XXX___XX, HMT0 ),                      // 06   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( X_X____X, HMT0 ),                      // 07   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 08   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 09   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT0 ),                      // 10   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _X____X_, HMT0 ),                      // 11   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 14   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XX_XX, HMT0 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XX_XX_XX, HMT0 ),                      // 16   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XX_XX_XX, HMT0 ),                      // 17   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 18   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( __X__X__, HMT0 ),                      // 19   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 20   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __XXXX__, HMT0 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 22   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_25[] = {

    29,
    0,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXX__XXX, HMT0 ),                      // 03   |🟩🟩🟩◼️◼️🟩🟩🟩|
    ONE( XX_X__XX, HMT0 ),                      // 04   |🟩🟩◼️🟩◼️◼️🟩🟩|
    ONE( XXX___XX, HMT0 ),                      // 05   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( X_X____X, HMT0 ),                      // 06   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 07   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 08   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 09   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT0 ),                      // 10   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XX__XX_, HMT0 ),                      // 11   |◼️🟩🟩◼️◼️🟩🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 14   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XX_XX, HMT0 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XX_XX_XX, HMT0 ),                      // 16   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 17   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 18   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_X__X_X, HMT0 ),                      // 19   |🟩◼️🟩◼️◼️🟩◼️🟩|
    ONE( X__XX__X, HMT0 ),                      // 20   |🟩◼️◼️🟩🟩◼️◼️🟩|
    ONE( __XXXX__, HMT0 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( ________, HMT0 ),                      // 23   |◼️◼️◼️◼️◼️◼️◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 24   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 25   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 26   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( ________, HMT0 ),                      // 27   |◼️◼️◼️◼️◼️◼️◼️◼️|
    ONE( ________, HMT0 ),                      // 28   |◼️◼️◼️◼️◼️◼️◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_26[] = {

    23,
    0,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT0 ),                      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX_X__XX, HMT0 ),                      // 05   |🟩🟩◼️🟩◼️◼️🟩🟩|
    ONE( XXX___XX, HMT0 ),                      // 06   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( X_X____X, HMT0 ),                      // 07   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 08   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 09   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT0 ),                      // 10   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _X____X_, HMT0 ),                      // 11   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 14   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XX_XX, HMT0 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XX_XX_XX, HMT0 ),                      // 16   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XX_XX_XX, HMT0 ),                      // 17   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 18   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( __X__X__, HMT0 ),                      // 19   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 20   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 21   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 22   |◼️◼️🟩◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_27[] = {

    26,
    0,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXX__XXX, HMT0 ),                      // 03   |🟩🟩🟩◼️◼️🟩🟩🟩|
    ONE( XX_X__XX, HMT0 ),                      // 04   |🟩🟩◼️🟩◼️◼️🟩🟩|
    ONE( XXX___XX, HMT0 ),                      // 05   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( X_X____X, HMT0 ),                      // 06   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 07   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 08   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 09   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT0 ),                      // 10   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XX__XX_, HMT0 ),                      // 11   |◼️🟩🟩◼️◼️🟩🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 14   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XX_XX, HMT0 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XX_XX_XX, HMT0 ),                      // 16   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 17   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 18   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_X__X_X, HMT0 ),                      // 19   |🟩◼️🟩◼️◼️🟩◼️🟩|
    ONE( X__XX__X, HMT0 ),                      // 20   |🟩◼️◼️🟩🟩◼️◼️🟩|
    ONE( __XXXX__, HMT0 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 24   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__XX_, HMT0 ),                      // 25   |◼️◼️🟩◼️◼️🟩🟩◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_28[] = {

    26,
    0,
    0,
                                                //      +-------------+
    ONE( ___XXX__, HMT0 ),                      // 00   |◼️◼️◼️🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXX__XX, HMT0 ),                      // 03   |🟩🟩🟩🟩◼️◼️🟩🟩|
    ONE( XXX__X_X, HMT0 ),                      // 04   |🟩🟩🟩◼️◼️🟩◼️🟩|
    ONE( X_X_X__X, HMT0 ),                      // 05   |🟩◼️🟩◼️🟩◼️◼️🟩|
    ONE( X_X_X__X, HMT0 ),                      // 06   |🟩◼️🟩◼️🟩◼️◼️🟩|
    ONE( X_X____X, HMT0 ),                      // 07   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( XXX____X, HMT0 ),                      // 08   |🟩🟩🟩◼️◼️◼️◼️🟩|
    ONE( XXX____X, HMT0 ),                      // 09   |🟩🟩🟩◼️◼️◼️◼️🟩|
    ONE( _XXX__X_, HMT0 ),                      // 10   |◼️🟩🟩🟩◼️◼️🟩◼️|
    ONE( _XXX__X_, HMT0 ),                      // 11   |◼️🟩🟩🟩◼️◼️🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( XXXXXXXX, HMT0 ),                      // 14   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX_XX_XX, HMT0 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 16   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 17   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( _X_XX_X_, HMT0 ),                      // 18   |◼️🟩◼️🟩🟩◼️🟩◼️|
    ONE( _X____X_, HMT0 ),                      // 19   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( ___XX___, HMT0 ),                      // 20   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __XXXX__, HMT0 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__XX_, HMT0 ),                      // 24   |◼️◼️🟩◼️◼️🟩🟩◼️|
    ONE( __X__X__, HMT0 ),                      // 25   |◼️◼️🟩◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_29[] = {

    26,
    0,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXX__XXX, HMT0 ),                      // 03   |🟩🟩🟩◼️◼️🟩🟩🟩|
    ONE( XX_X__XX, HMT0 ),                      // 04   |🟩🟩◼️🟩◼️◼️🟩🟩|
    ONE( XXX___XX, HMT0 ),                      // 05   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( X_X____X, HMT0 ),                      // 06   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 07   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 08   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 09   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT0 ),                      // 10   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XX__XX_, HMT0 ),                      // 11   |◼️🟩🟩◼️◼️🟩🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( XXXXXXXX, HMT0 ),                      // 14   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX_XX_XX, HMT0 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 16   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 17   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( _X_XX_X_, HMT0 ),                      // 18   |◼️🟩◼️🟩🟩◼️🟩◼️|
    ONE( _X____X_, HMT0 ),                      // 19   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( ___XX___, HMT0 ),                      // 20   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __XXXX__, HMT0 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 24   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__XX_, HMT0 ),                      // 25   |◼️◼️🟩◼️◼️🟩🟩◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_30[] = {

    26,
    0,
    0,
                                                //      +-------------+
    ONE( __XXX___, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩◼️◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX__XXXX, HMT0 ),                      // 03   |🟩🟩◼️◼️🟩🟩🟩🟩|
    ONE( X__X_XXX, HMT0 ),                      // 04   |🟩◼️◼️🟩◼️🟩🟩🟩|
    ONE( X_X__X_X, HMT0 ),                      // 05   |🟩◼️🟩◼️◼️🟩◼️🟩|
    ONE( X_X__X_X, HMT0 ),                      // 06   |🟩◼️🟩◼️◼️🟩◼️🟩|
    ONE( X____X_X, HMT0 ),                      // 07   |🟩◼️◼️◼️◼️🟩◼️🟩|
    ONE( X____XXX, HMT0 ),                      // 08   |🟩◼️◼️◼️◼️🟩🟩🟩|
    ONE( X____XXX, HMT0 ),                      // 09   |🟩◼️◼️◼️◼️🟩🟩🟩|
    ONE( _X__XXX_, HMT0 ),                      // 10   |◼️🟩◼️◼️🟩🟩🟩◼️|
    ONE( _X__XXX_, HMT0 ),                      // 11   |◼️🟩◼️◼️🟩🟩🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( XXXXXXXX, HMT0 ),                      // 14   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX_XX_XX, HMT0 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 16   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 17   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( _X_XX_X_, HMT0 ),                      // 18   |◼️🟩◼️🟩🟩◼️🟩◼️|
    ONE( _X____X_, HMT0 ),                      // 19   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( ___XX___, HMT0 ),                      // 20   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __XXXX__, HMT0 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__XX_, HMT0 ),                      // 24   |◼️◼️🟩◼️◼️🟩🟩◼️|
    ONE( __X__X__, HMT0 ),                      // 25   |◼️◼️🟩◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_31[] = {

    SPRITE_DOUBLE | 26,
    0,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXX__XXX, HMT0 ),                      // 03   |🟩🟩🟩◼️◼️🟩🟩🟩|
    ONE( XX_X__XX, HMT0 ),                      // 04   |🟩🟩◼️🟩◼️◼️🟩🟩|
    ONE( XXX___XX, HMT0 ),                      // 05   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( X_X____X, HMT0 ),                      // 06   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 07   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 08   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 09   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT0 ),                      // 10   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XX__XX_, HMT0 ),                      // 11   |◼️🟩🟩◼️◼️🟩🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 14   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XX_XX, HMT0 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XX_XX_XX, HMT0 ),                      // 16   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 17   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 18   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_X__X_X, HMT0 ),                      // 19   |🟩◼️🟩◼️◼️🟩◼️🟩|
    ONE( X__XX__X, HMT0 ),                      // 20   |🟩◼️◼️🟩🟩◼️◼️🟩|
    ONE( __XXXX__, HMT0 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 24   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 25   |◼️◼️🟩◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_32[] = {

    SPRITE_DOUBLE | 27,
    0,
    0,
                                                //      +---------------------------+
    TWO( ______XX, XX______, HMT0, HMT0 ),      // 00   |◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( _____XXX, XXX_____, HMT0, HMT0 ),      // 01   |◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️|
    TWO( _____XXX, XXX_____, HMT0, HMT0 ),      // 02   |◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️|
    TWO( ____XXX_, _XXX____, HMT0, HMT0 ),      // 03   |◼️◼️◼️◼️🟩🟩🟩◼️◼️🟩🟩🟩◼️◼️◼️◼️|
    TWO( ____XX_X, __XX____, HMT0, HMT0 ),      // 04   |◼️◼️◼️◼️🟩🟩◼️🟩◼️◼️🟩🟩◼️◼️◼️◼️|
    TWO( ____XXX_, __XX____, HMT0, HMT0 ),      // 05   |◼️◼️◼️◼️🟩🟩🟩◼️◼️◼️🟩🟩◼️◼️◼️◼️|
    TWO( ____X_X_, ___X____, HMT0, HMT0 ),      // 06   |◼️◼️◼️◼️🟩◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️|
    TWO( ____X___, ___X____, HMT0, HMT0 ),      // 07   |◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️|
    TWO( ____X___, ___X____, HMT0, HMT0 ),      // 08   |◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️|
    TWO( ____X___, ___X____, HMT0, HMT0 ),      // 09   |◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️|
    TWO( _____X__, __X_____, HMT0, HMT0 ),      // 10   |◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️|
    TWO( _____XX_, _XX_____, HMT0, HMT0 ),      // 11   |◼️◼️◼️◼️◼️🟩🟩◼️◼️🟩🟩◼️◼️◼️◼️◼️|
    TWO( ___X__XX, XX__X___, HMT0, HMT0 ),      // 12   |◼️◼️◼️🟩◼️◼️🟩🟩🟩🟩◼️◼️🟩◼️◼️◼️|
    TWO( __XXXX__, __XXXX__, HMT0, HMT0 ),      // 13   |◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️|
    TWO( __XXXXXX, XXXXXX__, HMT0, HMT0 ),      // 14   |◼️◼️🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️|
    TWO( ____XX_X, X_XX____, HMT0, HMT0 ),      // 15   |◼️◼️◼️◼️🟩🟩◼️🟩🟩◼️🟩🟩◼️◼️◼️◼️|
    TWO( _____X_X, X_X_____, HMT0, HMT0 ),      // 16   |◼️◼️◼️◼️◼️🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️|
    TWO( _____XXX, XXX_____, HMT0, HMT0 ),      // 17   |◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️|
    TWO( ______XX, XX______, HMT0, HMT0 ),      // 18   |◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( ______X_, _X______, HMT0, HMT0 ),      // 19   |◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( _______X, X_______, HMT0, HMT0 ),      // 20   |◼️◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ______XX, XX______, HMT0, HMT0 ),      // 21   |◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( _______X, X_______, HMT0, HMT0 ),      // 22   |◼️◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ______X_, _X______, HMT0, HMT0 ),      // 23   |◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( ______X_, _X______, HMT0, HMT0 ),      // 24   |◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( ______X_, _X______, HMT0, HMT0 ),      // 25   |◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( ________, ________, HMT0, HMT0 ),      // 26   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_33[] = {

    SPRITE_DOUBLE | 29,
    0,
    0,
                                                //      +---------------------------+
    TWO( ____X___, ___X____, HMT0, HMT0 ),      // 00   |◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️|
    TWO( ____X_XX, XX_X____, HMT0, HMT0 ),      // 01   |◼️◼️◼️◼️🟩◼️🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️|
    TWO( ___X_XXX, XXX_X___, HMT0, HMT0 ),      // 02   |◼️◼️◼️🟩◼️🟩🟩🟩🟩🟩🟩◼️🟩◼️◼️◼️|
    TWO( ___X_X__, __X_X___, HMT0, HMT0 ),      // 03   |◼️◼️◼️🟩◼️🟩◼️◼️◼️◼️🟩◼️🟩◼️◼️◼️|
    TWO( ___XXX_X, __XXX___, HMT0, HMT0 ),      // 04   |◼️◼️◼️🟩🟩🟩◼️🟩◼️◼️🟩🟩🟩◼️◼️◼️|
    TWO( ___XX_X_, ___XX___, HMT0, HMT0 ),      // 05   |◼️◼️◼️🟩🟩◼️🟩◼️◼️◼️◼️🟩🟩◼️◼️◼️|
    TWO( ___XX_X_, ___XX___, HMT0, HMT0 ),      // 06   |◼️◼️◼️🟩🟩◼️🟩◼️◼️◼️◼️🟩🟩◼️◼️◼️|
    TWO( ___XX___, ___XX___, HMT0, HMT0 ),      // 07   |◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️|
    TWO( ___XX___, ___XX___, HMT0, HMT0 ),      // 08   |◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️|
    TWO( ___XXX__, __XXX___, HMT0, HMT0 ),      // 09   |◼️◼️◼️🟩🟩🟩◼️◼️◼️◼️🟩🟩🟩◼️◼️◼️|
    TWO( ___XX_XX, XX_XX___, HMT0, HMT0 ),      // 10   |◼️◼️◼️🟩🟩◼️🟩🟩🟩🟩◼️🟩🟩◼️◼️◼️|
    TWO( ____X_XX, XX_X____, HMT0, HMT0 ),      // 11   |◼️◼️◼️◼️🟩◼️🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️|
    TWO( ____XX__, __XX____, HMT0, HMT0 ),      // 12   |◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️|
    TWO( ____XXXX, XXXX____, HMT0, HMT0 ),      // 13   |◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️|
    TWO( ____XX_X, X_X_____, HMT0, HMT0 ),      // 14   |◼️◼️◼️◼️🟩🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️|
    TWO( _____X_X, X_X_____, HMT0, HMT0 ),      // 15   |◼️◼️◼️◼️◼️🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️|
    TWO( ______XX, XX______, HMT0, HMT0 ),      // 16   |◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( ______XX, XX______, HMT0, HMT0 ),      // 17   |◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( _______X, X_______, HMT0, HMT0 ),      // 18   |◼️◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ______X_, _X______, HMT0, HMT0 ),      // 19   |◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( _____XXX, XXX_____, HMT0, HMT0 ),      // 20   |◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️|
    TWO( _____X_X, X_X_____, HMT0, HMT0 ),      // 21   |◼️◼️◼️◼️◼️🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️|
    TWO( _____X__, __X_____, HMT0, HMT0 ),      // 22   |◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️|
    TWO( ________, ________, HMT0, HMT0 ),      // 23   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ________, ________, HMT0, HMT0 ),      // 24   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ________, ________, HMT0, HMT0 ),      // 25   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ________, ________, HMT0, HMT0 ),      // 26   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ________, ________, HMT0, HMT0 ),      // 27   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ________, ________, HMT0, HMT0 ),      // 28   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_34[] = {

    SPRITE_DOUBLE | 27,
    0,
    0,
                                                //      +---------------------------+
    TWO( ______XX, XX______, HMT0, HMT0 ),      // 00   |◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( _____XXX, XXX_____, HMT0, HMT0 ),      // 01   |◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️|
    TWO( _____XXX, XXX_____, HMT0, HMT0 ),      // 02   |◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️|
    TWO( ____XXX_, _XXX____, HMT0, HMT0 ),      // 03   |◼️◼️◼️◼️🟩🟩🟩◼️◼️🟩🟩🟩◼️◼️◼️◼️|
    TWO( ____XX_X, __XX____, HMT0, HMT0 ),      // 04   |◼️◼️◼️◼️🟩🟩◼️🟩◼️◼️🟩🟩◼️◼️◼️◼️|
    TWO( ____XXX_, __XX____, HMT0, HMT0 ),      // 05   |◼️◼️◼️◼️🟩🟩🟩◼️◼️◼️🟩🟩◼️◼️◼️◼️|
    TWO( ____X_X_, ___X____, HMT0, HMT0 ),      // 06   |◼️◼️◼️◼️🟩◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️|
    TWO( ____X___, ___X____, HMT0, HMT0 ),      // 07   |◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️|
    TWO( ____X___, ___X____, HMT0, HMT0 ),      // 08   |◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️|
    TWO( ____X___, ___X____, HMT0, HMT0 ),      // 09   |◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️|
    TWO( _____X__, __X_____, HMT0, HMT0 ),      // 10   |◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️|
    TWO( _____XX_, _XX_____, HMT0, HMT0 ),      // 11   |◼️◼️◼️◼️◼️🟩🟩◼️◼️🟩🟩◼️◼️◼️◼️◼️|
    TWO( ___X__XX, XX__X___, HMT0, HMT0 ),      // 12   |◼️◼️◼️🟩◼️◼️🟩🟩🟩🟩◼️◼️🟩◼️◼️◼️|
    TWO( __XXXX__, __XXXX__, HMT0, HMT0 ),      // 13   |◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️|
    TWO( __XXXXXX, XXXXXX__, HMT0, HMT0 ),      // 14   |◼️◼️🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️|
    TWO( ____XX_X, X_XX____, HMT0, HMT0 ),      // 15   |◼️◼️◼️◼️🟩🟩◼️🟩🟩◼️🟩🟩◼️◼️◼️◼️|
    TWO( _____X_X, X_X_____, HMT0, HMT0 ),      // 16   |◼️◼️◼️◼️◼️🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️|
    TWO( _____XXX, XXX_____, HMT0, HMT0 ),      // 17   |◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️|
    TWO( ______XX, XX______, HMT0, HMT0 ),      // 18   |◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( ______X_, _X______, HMT0, HMT0 ),      // 19   |◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( _______X, X_______, HMT0, HMT0 ),      // 20   |◼️◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ______XX, XX______, HMT0, HMT0 ),      // 21   |◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( _______X, X_______, HMT0, HMT0 ),      // 22   |◼️◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ______X_, _X______, HMT0, HMT0 ),      // 23   |◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( _____X__, __X_____, HMT0, HMT0 ),      // 24   |◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️|
    TWO( _____X__, __X_____, HMT0, HMT0 ),      // 25   |◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️|
    TWO( ________, ________, HMT0, HMT0 ),      // 26   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_35[] = {

    20,
    0,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 03   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT0 ),                      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX_X__XX, HMT0 ),                      // 05   |🟩🟩◼️🟩◼️◼️🟩🟩|
    ONE( XXX___XX, HMT0 ),                      // 06   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( X_X____X, HMT0 ),                      // 07   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 08   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT0 ),                      // 09   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _X____X_, HMT0 ),                      // 10   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 11   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 12   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 13   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XX_XX, HMT0 ),                      // 14   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XXX__XXX, HMT0 ),                      // 15   |🟩🟩🟩◼️◼️🟩🟩🟩|
    ONE( X_X__X_X, HMT0 ),                      // 16   |🟩◼️🟩◼️◼️🟩◼️🟩|
    ONE( _X_XX_X_, HMT0 ),                      // 17   |◼️🟩◼️🟩🟩◼️🟩◼️|
    ONE( _X_XX_X_, HMT0 ),                      // 18   |◼️🟩◼️🟩🟩◼️🟩◼️|
    ONE( _XX__XX_, HMT0 ),                      // 19   |◼️🟩🟩◼️◼️🟩🟩◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_36[] = {

    23,
    0,
    0,
                                                //      +-------------+
    ONE( __X__X__, HMT0 ),                      // 00   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 01   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 02   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 03   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 04   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT0 ),                      // 05   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 06   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX_X__XX, HMT0 ),                      // 07   |🟩🟩◼️🟩◼️◼️🟩🟩|
    ONE( XXX___XX, HMT0 ),                      // 08   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( X_X____X, HMT0 ),                      // 09   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 10   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 11   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT0 ),                      // 12   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _X____X_, HMT0 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 14   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 15   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 16   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XX_XX, HMT0 ),                      // 17   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XXX__XXX, HMT0 ),                      // 18   |🟩🟩🟩◼️◼️🟩🟩🟩|
    ONE( X_X__X_X, HMT0 ),                      // 19   |🟩◼️🟩◼️◼️🟩◼️🟩|
    ONE( _X_XX_X_, HMT0 ),                      // 20   |◼️🟩◼️🟩🟩◼️🟩◼️|
    ONE( _X_XX_X_, HMT0 ),                      // 21   |◼️🟩◼️🟩🟩◼️🟩◼️|
    ONE( _XX__XX_, HMT0 ),                      // 22   |◼️🟩🟩◼️◼️🟩🟩◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_37[] = {

    SPRITE_DOUBLE | 26,
    0,
    0,
                                                //      +-------------+
    ONE( X______X, HMT0 ),                      // 00   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 01   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT0 ),                      // 02   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( ________, HMT0 ),                      // 03   |◼️◼️◼️◼️◼️◼️◼️◼️|
    ONE( X______X, HMT0 ),                      // 04   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( __XXXX__, HMT0 ),                      // 05   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 06   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 07   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT0 ),                      // 08   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 09   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX_X__XX, HMT0 ),                      // 10   |🟩🟩◼️🟩◼️◼️🟩🟩|
    ONE( XXX___XX, HMT0 ),                      // 11   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( X_X____X, HMT0 ),                      // 12   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 13   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 14   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT0 ),                      // 15   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _X____X_, HMT0 ),                      // 16   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 17   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 18   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 19   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XX_XX, HMT0 ),                      // 20   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XXX__XXX, HMT0 ),                      // 21   |🟩🟩🟩◼️◼️🟩🟩🟩|
    ONE( X_X__X_X, HMT0 ),                      // 22   |🟩◼️🟩◼️◼️🟩◼️🟩|
    ONE( _X_XX_X_, HMT0 ),                      // 23   |◼️🟩◼️🟩🟩◼️🟩◼️|
    ONE( _X_XX_X_, HMT0 ),                      // 24   |◼️🟩◼️🟩🟩◼️🟩◼️|
    ONE( _XX__XX_, HMT0 ),                      // 25   |◼️🟩🟩◼️◼️🟩🟩◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_38[] = {

    SPRITE_DOUBLE | 26,
    0,
    0,
                                                //      +---------------------------+
    TWO( X_______, _X______, HMT0, HMT0 ),      // 00   |🟩◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( ________, ________, HMT0, HMT0 ),      // 01   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ________, ________, HMT0, HMT0 ),      // 02   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ________, ________, HMT0, HMT0 ),      // 03   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ________, ________, HMT0, HMT0 ),      // 04   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ________, ________, HMT0, HMT0 ),      // 05   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___XXXX_, ________, HMT0, HMT0 ),      // 06   |◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __XXXXXX, ________, HMT0, HMT0 ),      // 07   |◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __XXXXXX, ________, HMT0, HMT0 ),      // 08   |◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __XXXXXX, ________, HMT0, HMT0 ),      // 09   |◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXXXXX, X_______, HMT0, HMT0 ),      // 10   |◼️🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XX_X__X, X_______, HMT0, HMT0 ),      // 11   |◼️🟩🟩◼️🟩◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXX___X, X_______, HMT0, HMT0 ),      // 12   |◼️🟩🟩🟩◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X_X____, X_______, HMT0, HMT0 ),      // 13   |◼️🟩◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X______, X_______, HMT0, HMT0 ),      // 14   |◼️🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( __X____X, ________, HMT0, HMT0 ),      // 15   |◼️◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __X____X, ________, HMT0, HMT0 ),      // 16   |◼️◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___XXXX_, ________, HMT0, HMT0 ),      // 17   |◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __X____X, ________, HMT0, HMT0 ),      // 18   |◼️◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __XXXXXX, ________, HMT0, HMT0 ),      // 19   |◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XX_XX_X, X_______, HMT0, HMT0 ),      // 20   |◼️🟩🟩◼️🟩🟩◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXX__XX, X_______, HMT0, HMT0 ),      // 21   |◼️🟩🟩🟩◼️◼️🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X_X__X_, X_______, HMT0, HMT0 ),      // 22   |◼️🟩◼️🟩◼️◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( __X_XX_X, ________, HMT0, HMT0 ),      // 23   |◼️◼️🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __X_XX_X, ________, HMT0, HMT0 ),      // 24   |◼️◼️🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __XX__XX, ________, HMT0, HMT0 ),      // 25   |◼️◼️🟩🟩◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_39[] = {

    26,
    0,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXX__XXX, HMT0 ),                      // 03   |🟩🟩🟩◼️◼️🟩🟩🟩|
    ONE( XX_X__XX, HMT0 ),                      // 04   |🟩🟩◼️🟩◼️◼️🟩🟩|
    ONE( XXX___XX, HMT0 ),                      // 05   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( X_X____X, HMT0 ),                      // 06   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 07   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 08   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 09   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT0 ),                      // 10   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XX__XX_, HMT0 ),                      // 11   |◼️🟩🟩◼️◼️🟩🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 14   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XX_XX, HMT0 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XX_XX_XX, HMT0 ),                      // 16   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 17   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 18   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_X__X_X, HMT0 ),                      // 19   |🟩◼️🟩◼️◼️🟩◼️🟩|
    ONE( X__XX__X, HMT0 ),                      // 20   |🟩◼️◼️🟩🟩◼️◼️🟩|
    ONE( __XXXX__, HMT0 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 24   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 25   |◼️◼️🟩◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_40[] = {

    26,
    0,
    0,
                                                //      +-------------+
    ONE( __XXX___, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩◼️◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX__XXXX, HMT0 ),                      // 03   |🟩🟩◼️◼️🟩🟩🟩🟩|
    ONE( X__X_XXX, HMT0 ),                      // 04   |🟩◼️◼️🟩◼️🟩🟩🟩|
    ONE( X_X__X_X, HMT0 ),                      // 05   |🟩◼️🟩◼️◼️🟩◼️🟩|
    ONE( X_X__X_X, HMT0 ),                      // 06   |🟩◼️🟩◼️◼️🟩◼️🟩|
    ONE( X____X_X, HMT0 ),                      // 07   |🟩◼️◼️◼️◼️🟩◼️🟩|
    ONE( X____XXX, HMT0 ),                      // 08   |🟩◼️◼️◼️◼️🟩🟩🟩|
    ONE( X____XXX, HMT0 ),                      // 09   |🟩◼️◼️◼️◼️🟩🟩🟩|
    ONE( _X__XXX_, HMT0 ),                      // 10   |◼️🟩◼️◼️🟩🟩🟩◼️|
    ONE( _X__XXX_, HMT0 ),                      // 11   |◼️🟩◼️◼️🟩🟩🟩◼️|
    ONE( __XXXX_X, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️🟩|
    ONE( ______XX, HMT0 ),                      // 13   |◼️◼️◼️◼️◼️◼️🟩🟩|
    ONE( __XXXX_X, HMT0 ),                      // 14   |◼️◼️🟩🟩🟩🟩◼️🟩|
    ONE( _X_X_XX_, HMT0 ),                      // 15   |◼️🟩◼️🟩◼️🟩🟩◼️|
    ONE( _X_X_XX_, HMT0 ),                      // 16   |◼️🟩◼️🟩◼️🟩🟩◼️|
    ONE( _XXX_XX_, HMT0 ),                      // 17   |◼️🟩🟩🟩◼️🟩🟩◼️|
    ONE( _XXX_XX_, HMT0 ),                      // 18   |◼️🟩🟩🟩◼️🟩🟩◼️|
    ONE( _X___XX_, HMT0 ),                      // 19   |◼️🟩◼️◼️◼️🟩🟩◼️|
    ONE( ___X_X__, HMT0 ),                      // 20   |◼️◼️◼️🟩◼️🟩◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 21   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( _____X__, HMT0 ),                      // 22   |◼️◼️◼️◼️◼️🟩◼️◼️|
    ONE( ___X_X__, HMT0 ),                      // 23   |◼️◼️◼️🟩◼️🟩◼️◼️|
    ONE( ___X____, HMT0 ),                      // 24   |◼️◼️◼️🟩◼️◼️◼️◼️|
    ONE( ___X____, HMT0 ),                      // 25   |◼️◼️◼️🟩◼️◼️◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_41[] = {

    26,
    0,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XXXXX, HMT0 ),                      // 03   |🟩🟩◼️🟩🟩🟩🟩🟩|
    ONE( X___XXXX, HMT0 ),                      // 04   |🟩◼️◼️◼️🟩🟩🟩🟩|
    ONE( X_X_X_XX, HMT0 ),                      // 05   |🟩◼️🟩◼️🟩◼️🟩🟩|
    ONE( X_X_X_XX, HMT0 ),                      // 06   |🟩◼️🟩◼️🟩◼️🟩🟩|
    ONE( X___X_XX, HMT0 ),                      // 07   |🟩◼️◼️◼️🟩◼️🟩🟩|
    ONE( X___XXXX, HMT0 ),                      // 08   |🟩◼️◼️◼️🟩🟩🟩🟩|
    ONE( X___XXXX, HMT0 ),                      // 09   |🟩◼️◼️◼️🟩🟩🟩🟩|
    ONE( _X_XXXX_, HMT0 ),                      // 10   |◼️🟩◼️🟩🟩🟩🟩◼️|
    ONE( _X_XXXX_, HMT0 ),                      // 11   |◼️🟩◼️🟩🟩🟩🟩◼️|
    ONE( __XXXX_X, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️🟩|
    ONE( ______XX, HMT0 ),                      // 13   |◼️◼️◼️◼️◼️◼️🟩🟩|
    ONE( __X_XX_X, HMT0 ),                      // 14   |◼️◼️🟩◼️🟩🟩◼️🟩|
    ONE( __X_XX_X, HMT0 ),                      // 15   |◼️◼️🟩◼️🟩🟩◼️🟩|
    ONE( __X_XXXX, HMT0 ),                      // 16   |◼️◼️🟩◼️🟩🟩🟩🟩|
    ONE( ____XX_X, HMT0 ),                      // 17   |◼️◼️◼️◼️🟩🟩◼️🟩|
    ONE( __X_XX_X, HMT0 ),                      // 18   |◼️◼️🟩◼️🟩🟩◼️🟩|
    ONE( __X_XX_X, HMT0 ),                      // 19   |◼️◼️🟩◼️🟩🟩◼️🟩|
    ONE( ___X_X_X, HMT0 ),                      // 20   |◼️◼️◼️🟩◼️🟩◼️🟩|
    ONE( ___XX___, HMT0 ),                      // 21   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( ____XX__, HMT0 ),                      // 23   |◼️◼️◼️◼️🟩🟩◼️◼️|
    ONE( ____XX__, HMT0 ),                      // 24   |◼️◼️◼️◼️🟩🟩◼️◼️|
    ONE( ___XXX__, HMT0 ),                      // 25   |◼️◼️◼️🟩🟩🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_42[] = {

    26,
    0,
    0,
                                                //      +-------------+
    ONE( __XXX___, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩◼️◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT0 ),                      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX_XXXX_, HMT0 ),                      // 05   |🟩🟩◼️🟩🟩🟩🟩◼️|
    ONE( XX_XXXX_, HMT0 ),                      // 06   |🟩🟩◼️🟩🟩🟩🟩◼️|
    ONE( XX_XXXX_, HMT0 ),                      // 07   |🟩🟩◼️🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT0 ),                      // 08   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 09   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( _XXXXXX_, HMT0 ),                      // 10   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXX____, HMT0 ),                      // 11   |◼️🟩🟩🟩◼️◼️◼️◼️|
    ONE( __X_XXX_, HMT0 ),                      // 12   |◼️◼️🟩◼️🟩🟩🟩◼️|
    ONE( ____XXX_, HMT0 ),                      // 13   |◼️◼️◼️◼️🟩🟩🟩◼️|
    ONE( __X_X___, HMT0 ),                      // 14   |◼️◼️🟩◼️🟩◼️◼️◼️|
    ONE( __X_XXX_, HMT0 ),                      // 15   |◼️◼️🟩◼️🟩🟩🟩◼️|
    ONE( _XX_XXX_, HMT0 ),                      // 16   |◼️🟩🟩◼️🟩🟩🟩◼️|
    ONE( _XX_X___, HMT0 ),                      // 17   |◼️🟩🟩◼️🟩◼️◼️◼️|
    ONE( _XX_XXX_, HMT0 ),                      // 18   |◼️🟩🟩◼️🟩🟩🟩◼️|
    ONE( _X__XXX_, HMT0 ),                      // 19   |◼️🟩◼️◼️🟩🟩🟩◼️|
    ONE( __X_X___, HMT0 ),                      // 20   |◼️◼️🟩◼️🟩◼️◼️◼️|
    ONE( ___XXX__, HMT0 ),                      // 21   |◼️◼️◼️🟩🟩🟩◼️◼️|
    ONE( __X_____, HMT0 ),                      // 22   |◼️◼️🟩◼️◼️◼️◼️◼️|
    ONE( __X_X___, HMT0 ),                      // 23   |◼️◼️🟩◼️🟩◼️◼️◼️|
    ONE( ____X___, HMT0 ),                      // 24   |◼️◼️◼️◼️🟩◼️◼️◼️|
    ONE( ____X___, HMT0 ),                      // 25   |◼️◼️◼️◼️🟩◼️◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_44[] = {

    26,
    0,
    0,
                                                //      +-------------+
    ONE( ___XXX__, HMT0 ),                      // 00   |◼️◼️◼️🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT0 ),                      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( _XXXX_XX, HMT0 ),                      // 05   |◼️🟩🟩🟩🟩◼️🟩🟩|
    ONE( _XXXX_XX, HMT0 ),                      // 06   |◼️🟩🟩🟩🟩◼️🟩🟩|
    ONE( _XXXX_XX, HMT0 ),                      // 07   |◼️🟩🟩🟩🟩◼️🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 08   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 09   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( _XXXXXX_, HMT0 ),                      // 10   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( ____XXX_, HMT0 ),                      // 11   |◼️◼️◼️◼️🟩🟩🟩◼️|
    ONE( _XXX_X__, HMT0 ),                      // 12   |◼️🟩🟩🟩◼️🟩◼️◼️|
    ONE( _XXX____, HMT0 ),                      // 13   |◼️🟩🟩🟩◼️◼️◼️◼️|
    ONE( ___X_X__, HMT0 ),                      // 14   |◼️◼️◼️🟩◼️🟩◼️◼️|
    ONE( _XXX_X__, HMT0 ),                      // 15   |◼️🟩🟩🟩◼️🟩◼️◼️|
    ONE( _XXX_XX_, HMT0 ),                      // 16   |◼️🟩🟩🟩◼️🟩🟩◼️|
    ONE( ___X_XX_, HMT0 ),                      // 17   |◼️◼️◼️🟩◼️🟩🟩◼️|
    ONE( _XXX_XX_, HMT0 ),                      // 18   |◼️🟩🟩🟩◼️🟩🟩◼️|
    ONE( _XXX__X_, HMT0 ),                      // 19   |◼️🟩🟩🟩◼️◼️🟩◼️|
    ONE( ___X_X__, HMT0 ),                      // 20   |◼️◼️◼️🟩◼️🟩◼️◼️|
    ONE( __XXX___, HMT0 ),                      // 21   |◼️◼️🟩🟩🟩◼️◼️◼️|
    ONE( _____X__, HMT0 ),                      // 22   |◼️◼️◼️◼️◼️🟩◼️◼️|
    ONE( ___X_X__, HMT0 ),                      // 23   |◼️◼️◼️🟩◼️🟩◼️◼️|
    ONE( ___X____, HMT0 ),                      // 24   |◼️◼️◼️🟩◼️◼️◼️◼️|
    ONE( ___X____, HMT0 ),                      // 25   |◼️◼️◼️🟩◼️◼️◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_45[] = {

    26,
    0,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXX_XX, HMT0 ),                      // 03   |🟩🟩🟩🟩🟩◼️🟩🟩|
    ONE( XXXX___X, HMT0 ),                      // 04   |🟩🟩🟩🟩◼️◼️◼️🟩|
    ONE( XX_X_X_X, HMT0 ),                      // 05   |🟩🟩◼️🟩◼️🟩◼️🟩|
    ONE( XX_X_X_X, HMT0 ),                      // 06   |🟩🟩◼️🟩◼️🟩◼️🟩|
    ONE( XX_X___X, HMT0 ),                      // 07   |🟩🟩◼️🟩◼️◼️◼️🟩|
    ONE( XXXX___X, HMT0 ),                      // 08   |🟩🟩🟩🟩◼️◼️◼️🟩|
    ONE( XXXX___X, HMT0 ),                      // 09   |🟩🟩🟩🟩◼️◼️◼️🟩|
    ONE( _XXXX_X_, HMT0 ),                      // 10   |◼️🟩🟩🟩🟩◼️🟩◼️|
    ONE( _XXXX_X_, HMT0 ),                      // 11   |◼️🟩🟩🟩🟩◼️🟩◼️|
    ONE( X_XXXX__, HMT0 ),                      // 12   |🟩◼️🟩🟩🟩🟩◼️◼️|
    ONE( XX______, HMT0 ),                      // 13   |🟩🟩◼️◼️◼️◼️◼️◼️|
    ONE( X_XX_X__, HMT0 ),                      // 14   |🟩◼️🟩🟩◼️🟩◼️◼️|
    ONE( X_XX_X__, HMT0 ),                      // 15   |🟩◼️🟩🟩◼️🟩◼️◼️|
    ONE( XXXX_X__, HMT0 ),                      // 16   |🟩🟩🟩🟩◼️🟩◼️◼️|
    ONE( X_XX____, HMT0 ),                      // 17   |🟩◼️🟩🟩◼️◼️◼️◼️|
    ONE( X_XX_X__, HMT0 ),                      // 18   |🟩◼️🟩🟩◼️🟩◼️◼️|
    ONE( X_XX_X__, HMT0 ),                      // 19   |🟩◼️🟩🟩◼️🟩◼️◼️|
    ONE( X_X_X___, HMT0 ),                      // 20   |🟩◼️🟩◼️🟩◼️◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 21   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __XX____, HMT0 ),                      // 23   |◼️◼️🟩🟩◼️◼️◼️◼️|
    ONE( __XX____, HMT0 ),                      // 24   |◼️◼️🟩🟩◼️◼️◼️◼️|
    ONE( __XXX___, HMT0 ),                      // 25   |◼️◼️🟩🟩🟩◼️◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_46[] = {

    26,
    0,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXX__XXX, HMT0 ),                      // 03   |🟩🟩🟩◼️◼️🟩🟩🟩|
    ONE( XX_X__XX, HMT0 ),                      // 04   |🟩🟩◼️🟩◼️◼️🟩🟩|
    ONE( XXX___XX, HMT0 ),                      // 05   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( X_X____X, HMT0 ),                      // 06   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 07   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 08   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 09   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT0 ),                      // 10   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XX__XX_, HMT0 ),                      // 11   |◼️🟩🟩◼️◼️🟩🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 14   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XX_XX, HMT0 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XX_XX_XX, HMT0 ),                      // 16   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 17   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 18   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_X__X_X, HMT0 ),                      // 19   |🟩◼️🟩◼️◼️🟩◼️🟩|
    ONE( X__XX__X, HMT0 ),                      // 20   |🟩◼️◼️🟩🟩◼️◼️🟩|
    ONE( __XXXX__, HMT0 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 24   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 25   |◼️◼️🟩◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_47[] = {

    SPRITE_DOUBLE | 26,
    0,
    0,
                                                //      +---------------------------+
    TWO( ______XX, XX______, HMT0, HMT0 ),      // 00   |◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( _____XXX, XXX_____, HMT0, HMT0 ),      // 01   |◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️|
    TWO( _____XX_, _XX_____, HMT0, HMT0 ),      // 02   |◼️◼️◼️◼️◼️🟩🟩◼️◼️🟩🟩◼️◼️◼️◼️◼️|
    TWO( ____XX_X, __XX____, HMT0, HMT0 ),      // 03   |◼️◼️◼️◼️🟩🟩◼️🟩◼️◼️🟩🟩◼️◼️◼️◼️|
    TWO( ____XXX_, __XX____, HMT0, HMT0 ),      // 04   |◼️◼️◼️◼️🟩🟩🟩◼️◼️◼️🟩🟩◼️◼️◼️◼️|
    TWO( ____X_X_, ___X____, HMT0, HMT0 ),      // 05   |◼️◼️◼️◼️🟩◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️|
    TWO( ____X___, ___X____, HMT0, HMT0 ),      // 06   |◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️|
    TWO( ____X___, ___X____, HMT0, HMT0 ),      // 07   |◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️|
    TWO( ____X___, ___X____, HMT0, HMT0 ),      // 08   |◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️|
    TWO( ____XX__, __XX____, HMT0, HMT0 ),      // 09   |◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️|
    TWO( _____XX_, _XX_____, HMT0, HMT0 ),      // 10   |◼️◼️◼️◼️◼️🟩🟩◼️◼️🟩🟩◼️◼️◼️◼️◼️|
    TWO( _____XXX, XXX_____, HMT0, HMT0 ),      // 11   |◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️|
    TWO( ___X__XX, XX__X___, HMT0, HMT0 ),      // 12   |◼️◼️◼️🟩◼️◼️🟩🟩🟩🟩◼️◼️🟩◼️◼️◼️|
    TWO( __XXXX__, __XXXX__, HMT0, HMT0 ),      // 13   |◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️|
    TWO( __XXXXXX, XXXXXX__, HMT0, HMT0 ),      // 14   |◼️◼️🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️|
    TWO( ____XX_X, X_XX____, HMT0, HMT0 ),      // 15   |◼️◼️◼️◼️🟩🟩◼️🟩🟩◼️🟩🟩◼️◼️◼️◼️|
    TWO( _____X_X, X_X_____, HMT0, HMT0 ),      // 16   |◼️◼️◼️◼️◼️🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️|
    TWO( _____XXX, XXX_____, HMT0, HMT0 ),      // 17   |◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️|
    TWO( ______XX, XX______, HMT0, HMT0 ),      // 18   |◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( ______X_, _X______, HMT0, HMT0 ),      // 19   |◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( _______X, X_______, HMT0, HMT0 ),      // 20   |◼️◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ______XX, XX______, HMT0, HMT0 ),      // 21   |◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( _______X, X_______, HMT0, HMT0 ),      // 22   |◼️◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ______X_, _X______, HMT0, HMT0 ),      // 23   |◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( ______X_, _X______, HMT0, HMT0 ),      // 24   |◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( ______X_, _X______, HMT0, HMT0 ),      // 25   |◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_48[] = {

    SPRITE_DOUBLE | 26,
    0,
    0,
                                                //      +---------------------------+
    TWO( ___X____, ____X___, HMT0, HMT0 ),      // 00   |◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️|
    TWO( ____XX__, __XX____, HMT0, HMT0 ),      // 01   |◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️|
    TWO( ____X___, ___X____, HMT0, HMT0 ),      // 02   |◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️|
    TWO( ___X__XX, XX__X___, HMT0, HMT0 ),      // 03   |◼️◼️◼️🟩◼️◼️🟩🟩🟩🟩◼️◼️🟩◼️◼️◼️|
    TWO( ___X_X__, __X_X___, HMT0, HMT0 ),      // 04   |◼️◼️◼️🟩◼️🟩◼️◼️◼️◼️🟩◼️🟩◼️◼️◼️|
    TWO( __XX_X_X, __X_XX__, HMT0, HMT0 ),      // 05   |◼️◼️🟩🟩◼️🟩◼️🟩◼️◼️🟩◼️🟩🟩◼️◼️|
    TWO( ___XX_X_, ___XX___, HMT0, HMT0 ),      // 06   |◼️◼️◼️🟩🟩◼️🟩◼️◼️◼️◼️🟩🟩◼️◼️◼️|
    TWO( ___XX_X_, ___XX___, HMT0, HMT0 ),      // 07   |◼️◼️◼️🟩🟩◼️🟩◼️◼️◼️◼️🟩🟩◼️◼️◼️|
    TWO( ___XX___, ___XX___, HMT0, HMT0 ),      // 08   |◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️|
    TWO( ___XX___, ___XX___, HMT0, HMT0 ),      // 09   |◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️|
    TWO( ___XXX__, __XXX___, HMT0, HMT0 ),      // 10   |◼️◼️◼️🟩🟩🟩◼️◼️◼️◼️🟩🟩🟩◼️◼️◼️|
    TWO( ___XXXXX, XXXXX___, HMT0, HMT0 ),      // 11   |◼️◼️◼️🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️◼️|
    TWO( ____X_XX, XX_X____, HMT0, HMT0 ),      // 12   |◼️◼️◼️◼️🟩◼️🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️|
    TWO( ____X_XX, XX_X____, HMT0, HMT0 ),      // 13   |◼️◼️◼️◼️🟩◼️🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️|
    TWO( ____XX__, __XX____, HMT0, HMT0 ),      // 14   |◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️|
    TWO( ____XXXX, XXX_____, HMT0, HMT0 ),      // 15   |◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️|
    TWO( _____X_X, X_X_____, HMT0, HMT0 ),      // 16   |◼️◼️◼️◼️◼️🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️|
    TWO( _____X_X, X_X_____, HMT0, HMT0 ),      // 17   |◼️◼️◼️◼️◼️🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️|
    TWO( ______XX, XX______, HMT0, HMT0 ),      // 18   |◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( ______XX, XX______, HMT0, HMT0 ),      // 19   |◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( ______X_, _X______, HMT0, HMT0 ),      // 20   |◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( _____X_X, X_X_____, HMT0, HMT0 ),      // 21   |◼️◼️◼️◼️◼️🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️|
    TWO( _____XXX, XXX_____, HMT0, HMT0 ),      // 22   |◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️|
    TWO( _____X_X, X_X_____, HMT0, HMT0 ),      // 23   |◼️◼️◼️◼️◼️🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️|
    TWO( _____X__, __X_____, HMT0, HMT0 ),      // 24   |◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️|
    TWO( _____X__, __X_____, HMT0, HMT0 ),      // 25   |◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_49[] = {

    SPRITE_DOUBLE | 23,
    0,
    0,
                                                //      +---------------------------+
    TWO( ___X____, ____X___, HMT0, HMT0 ),      // 00   |◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️|
    TWO( X___XX__, __XX___X, HMT0, HMT0 ),      // 01   |🟩◼️◼️◼️🟩🟩◼️◼️◼️◼️🟩🟩◼️◼️◼️🟩|
    TWO( X___X___, ___X___X, HMT0, HMT0 ),      // 02   |🟩◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️🟩|
    TWO( _X__X___, ___X__X_, HMT0, HMT0 ),      // 03   |◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️|
    TWO( ___X__XX, XX__X___, HMT0, HMT0 ),      // 04   |◼️◼️◼️🟩◼️◼️🟩🟩🟩🟩◼️◼️🟩◼️◼️◼️|
    TWO( ___X_XXX, XXX_X___, HMT0, HMT0 ),      // 05   |◼️◼️◼️🟩◼️🟩🟩🟩🟩🟩🟩◼️🟩◼️◼️◼️|
    TWO( _X_X_X__, __X_X_X_, HMT0, HMT0 ),      // 06   |◼️🟩◼️🟩◼️🟩◼️◼️◼️◼️🟩◼️🟩◼️🟩◼️|
    TWO( ___XXX_X, __XXX___, HMT0, HMT0 ),      // 07   |◼️◼️◼️🟩🟩🟩◼️🟩◼️◼️🟩🟩🟩◼️◼️◼️|
    TWO( ___XX_X_, ___XX___, HMT0, HMT0 ),      // 08   |◼️◼️◼️🟩🟩◼️🟩◼️◼️◼️◼️🟩🟩◼️◼️◼️|
    TWO( ___XX_X_, ___XX___, HMT0, HMT0 ),      // 09   |◼️◼️◼️🟩🟩◼️🟩◼️◼️◼️◼️🟩🟩◼️◼️◼️|
    TWO( ___XX___, ___XX___, HMT0, HMT0 ),      // 10   |◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️|
    TWO( ___XX___, ___XX___, HMT0, HMT0 ),      // 11   |◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️|
    TWO( ___XX___, ___XX___, HMT0, HMT0 ),      // 12   |◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️|
    TWO( ____XX__, __XX____, HMT0, HMT0 ),      // 13   |◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️|
    TWO( ____X_XX, XX_X____, HMT0, HMT0 ),      // 14   |◼️◼️◼️◼️🟩◼️🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️|
    TWO( ____XX__, __XX____, HMT0, HMT0 ),      // 15   |◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️|
    TWO( _____XXX, XXX_____, HMT0, HMT0 ),      // 16   |◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️|
    TWO( _____X_X, X_X_____, HMT0, HMT0 ),      // 17   |◼️◼️◼️◼️◼️🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️|
    TWO( ______XX, XX______, HMT0, HMT0 ),      // 18   |◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( _____X_X, X_X_____, HMT0, HMT0 ),      // 19   |◼️◼️◼️◼️◼️🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️|
    TWO( ____X_X_, _X_X____, HMT0, HMT0 ),      // 20   |◼️◼️◼️◼️🟩◼️🟩◼️◼️🟩◼️🟩◼️◼️◼️◼️|
    TWO( ____X__X, X__X____, HMT0, HMT0 ),      // 21   |◼️◼️◼️◼️🟩◼️◼️🟩🟩◼️◼️🟩◼️◼️◼️◼️|
    TWO( _____X__, __X_____, HMT0, HMT0 ),      // 22   |◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_50[] = {

    SPRITE_DOUBLE | 16,
    0,
    0,
                                                //      +---------------------------+
    TWO( X__X____, ____X__X, HMT0, HMT0 ),      // 00   |🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩|
    TWO( ___XX___, ___XX___, HMT0, HMT0 ),      // 01   |◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️|
    TWO( ___X__XX, XX__X___, HMT0, HMT0 ),      // 02   |◼️◼️◼️🟩◼️◼️🟩🟩🟩🟩◼️◼️🟩◼️◼️◼️|
    TWO( __XX_XXX, XXX_XX__, HMT0, HMT0 ),      // 03   |◼️◼️🟩🟩◼️🟩🟩🟩🟩🟩🟩◼️🟩🟩◼️◼️|
    TWO( __X__X__, __X__X__, HMT0, HMT0 ),      // 04   |◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️|
    TWO( __X_XXX_, __XX_X__, HMT0, HMT0 ),      // 05   |◼️◼️🟩◼️🟩🟩🟩◼️◼️◼️🟩🟩◼️🟩◼️◼️|
    TWO( __X_X__X, ___X_X__, HMT0, HMT0 ),      // 06   |◼️◼️🟩◼️🟩◼️◼️🟩◼️◼️◼️🟩◼️🟩◼️◼️|
    TWO( __XXX___, X__XXX__, HMT0, HMT0 ),      // 07   |◼️◼️🟩🟩🟩◼️◼️◼️🟩◼️◼️🟩🟩🟩◼️◼️|
    TWO( ___XX__X, _X_XX___, HMT0, HMT0 ),      // 08   |◼️◼️◼️🟩🟩◼️◼️🟩◼️🟩◼️🟩🟩◼️◼️◼️|
    TWO( ___XX___, ___XX___, HMT0, HMT0 ),      // 09   |◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️|
    TWO( ____X___, ___X____, HMT0, HMT0 ),      // 10   |◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️|
    TWO( ____XX__, __XX____, HMT0, HMT0 ),      // 11   |◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️|
    TWO( ____XXXX, XXXX____, HMT0, HMT0 ),      // 12   |◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️|
    TWO( ___X_X__, __X_X___, HMT0, HMT0 ),      // 13   |◼️◼️◼️🟩◼️🟩◼️◼️◼️◼️🟩◼️🟩◼️◼️◼️|
    TWO( ___X__XX, XX__X___, HMT0, HMT0 ),      // 14   |◼️◼️◼️🟩◼️◼️🟩🟩🟩🟩◼️◼️🟩◼️◼️◼️|
    TWO( ____X___, ___X____, HMT0, HMT0 ),      // 15   |◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_51[] = {

    SPRITE_DOUBLE | 13,
    0,
    0,
                                                //      +---------------------------+
    TWO( ___X____, ____X___, HMT0, HMT0 ),      // 00   |◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️|
    TWO( _X_XX___, ___XX_X_, HMT0, HMT0 ),      // 01   |◼️🟩◼️🟩🟩◼️◼️◼️◼️◼️◼️🟩🟩◼️🟩◼️|
    TWO( ___X__XX, XX__X___, HMT0, HMT0 ),      // 02   |◼️◼️◼️🟩◼️◼️🟩🟩🟩🟩◼️◼️🟩◼️◼️◼️|
    TWO( __XX_XXX, XXX_XX__, HMT0, HMT0 ),      // 03   |◼️◼️🟩🟩◼️🟩🟩🟩🟩🟩🟩◼️🟩🟩◼️◼️|
    TWO( __X__X__, __X__X__, HMT0, HMT0 ),      // 04   |◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️|
    TWO( __X_X__X, _X_X_X__, HMT0, HMT0 ),      // 05   |◼️◼️🟩◼️🟩◼️◼️🟩◼️🟩◼️🟩◼️🟩◼️◼️|
    TWO( __X_X___, X__X_X__, HMT0, HMT0 ),      // 06   |◼️◼️🟩◼️🟩◼️◼️◼️🟩◼️◼️🟩◼️🟩◼️◼️|
    TWO( ___X___X, _X__X___, HMT0, HMT0 ),      // 07   |◼️◼️◼️🟩◼️◼️◼️🟩◼️🟩◼️◼️🟩◼️◼️◼️|
    TWO( ___X__X_, __X_X___, HMT0, HMT0 ),      // 08   |◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️🟩◼️🟩◼️◼️◼️|
    TWO( ___X__X_, ____X___, HMT0, HMT0 ),      // 09   |◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️🟩◼️◼️◼️|
    TWO( _X_XX___, ___XX_X_, HMT0, HMT0 ),      // 10   |◼️🟩◼️🟩🟩◼️◼️◼️◼️◼️◼️🟩🟩◼️🟩◼️|
    TWO( _X__XXXX, XXXX__X_, HMT0, HMT0 ),      // 11   |◼️🟩◼️◼️🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️🟩◼️|
    TWO( __X__XXX, XXX__X__, HMT0, HMT0 ),      // 12   |◼️◼️🟩◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️🟩◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_01[] = {

    9,
    0,
    0,
                                                //      +-------------+
    ONE(__X__X__, NONE ),                       // 00   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE(___XX___, NONE ),                       // 01   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE(_X_XX_X_, NONE ),                       // 02   |◼️🟩◼️🟩🟩◼️🟩◼️|
    ONE(_X_XX_X_, NONE ),                       // 03   |◼️🟩◼️🟩🟩◼️🟩◼️|
    ONE(___XX___, NONE ),                       // 04   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE(__X__X__, NONE ),                       // 05   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE(________, NONE ),                       // 06   |◼️◼️◼️◼️◼️◼️◼️◼️|
    ONE(________, NONE ),                       // 07   |◼️◼️◼️◼️◼️◼️◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_00[] = {

    26,
    0,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXX__XXX, HMT0 ),                      // 03   |🟩🟩🟩◼️◼️🟩🟩🟩|
    ONE( XX_X__XX, HMT0 ),                      // 04   |🟩🟩◼️🟩◼️◼️🟩🟩|
    ONE( XXX___XX, HMT0 ),                      // 05   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( X_X____X, HMT0 ),                      // 06   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 07   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 08   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT0 ),                      // 09   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT0 ),                      // 10   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XX__XX_, HMT0 ),                      // 11   |◼️🟩🟩◼️◼️🟩🟩◼️|
    ONE( __XXXX__, HMT0 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, HMT0 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 14   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XX_XX, HMT0 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XX_XX_XX, HMT0 ),                      // 16   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XXXXXXXX, HMT0 ),                      // 17   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( X_XXXX_X, HMT0 ),                      // 18   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_X__X_X, HMT0 ),                      // 19   |🟩◼️🟩◼️◼️🟩◼️🟩|
    ONE( X__XX__X, HMT0 ),                      // 20   |🟩◼️◼️🟩🟩◼️◼️🟩|
    ONE( __XXXX__, HMT0 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, HMT0 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 24   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 25   |◼️◼️🟩◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_STAND[] = {

    26,
    4 + 0,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXX__XXX, HMT1 ),                      // 03   |🟩🟩🟩◼️◼️🟩🟩🟩|
    ONE( XX_X__XX, HMT1 ),                      // 04   |🟩🟩◼️🟩◼️◼️🟩🟩|
    ONE( XXX___XX, HMT1 ),                      // 05   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( X_X____X, HMT1 ),                      // 06   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( X______X, HMT2 ),                      // 07   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT2 ),                      // 08   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT2 ),                      // 09   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT3 ),                      // 10   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XX__XX_, HMT3 ),                      // 11   |◼️🟩🟩◼️◼️🟩🟩◼️|
    ONE( __XXXX__, HMT3 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, BDY1 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XXXXXX_, BDY0 ),                      // 14   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XX_XX, BDY1 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XX_XX_XX, BDY1 ),                      // 16   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XXXXXXXX, BDY2 ),                      // 17   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( X_XXXX_X, BDY2 ),                      // 18   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_X__X_X, BDY2 ),                      // 19   |🟩◼️🟩◼️◼️🟩◼️🟩|
    ONE( X__XX__X, HMT1 ),                      // 20   |🟩◼️◼️🟩🟩◼️◼️🟩|
    ONE( __XXXX__, HMT1 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, HMT1 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT1 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT2 ),                      // 24   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 25   |◼️◼️🟩◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_ARMS_IN_AIR[] = {

    SPRITE_DOUBLE | 24,
    2,
    5,
                                                //      +---------------------------+
    TWO( __X_____, _X______, HMT0, BONE ),      // 00   |◼️◼️🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( __X_XXXX, _X______, HMT0, BONE ),      // 01   |◼️◼️🟩◼️🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( _X_XXXXX, X_X_____, HMT0, BONE ),      // 02   |◼️🟩◼️🟩🟩🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️◼️|
    TWO( _X_X____, X_X_____, HMT1, BONE ),      // 03   |◼️🟩◼️🟩◼️◼️◼️◼️🟩◼️🟩◼️◼️◼️◼️◼️|
    TWO( _XXX_X__, XXX_____, HMT1, BONE ),      // 04   |◼️🟩🟩🟩◼️🟩◼️◼️🟩🟩🟩◼️◼️◼️◼️◼️|
    TWO( _XX_X___, _XX_____, HMT1, BONE ),      // 05   |◼️🟩🟩◼️🟩◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️|
    TWO( _XX_X___, _XX_____, HMT1, BONE ),      // 06   |◼️🟩🟩◼️🟩◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️|
    TWO( _XX_____, _XX_____, HMT2, BONE ),      // 07   |◼️🟩🟩◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️|
    TWO( _XX_____, _XX_____, HMT2, BONE ),      // 08   |◼️🟩🟩◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️|
    TWO( _XXX____, XXX_____, HMT2, BONE ),      // 09   |◼️🟩🟩🟩◼️◼️◼️◼️🟩🟩🟩◼️◼️◼️◼️◼️|
    TWO( _XX_XXXX, _XX_____, HMT3, BONE ),      // 10   |◼️🟩🟩◼️🟩🟩🟩🟩◼️🟩🟩◼️◼️◼️◼️◼️|
    TWO( __X_XXXX, _X______, HMT3, BONE ),      // 11   |◼️◼️🟩◼️🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( __XX____, XX______, HMT3, BONE ),      // 12   |◼️◼️🟩🟩◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( __XXXXXX, XX______, BDY1, BONE ),      // 13   |◼️◼️🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( __XX_XX_, X_______, BDY0, BONE ),      // 14   |◼️◼️🟩🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___X_XX_, X_______, BDY1, BONE ),      // 15   |◼️◼️◼️🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____XXXX, ________, BDY2, BONE ),      // 16   |◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____XXXX, ________, BDY2, BONE ),      // 17   |◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _____XX_, ________, BDY2, BONE ),      // 18   |◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____X__X, ________, BDY2, BONE ),      // 19   |◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___XXXXX, X_______, HMT1, BONE ),      // 20   |◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___X_XX_, X_______, HMT1, BONE ),      // 21   |◼️◼️◼️🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( __XX____, XX______, HMT2, BONE ),      // 22   |◼️◼️🟩🟩◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( __X_____, _X______, HMT0, BONE ),      // 23   |◼️◼️🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_HUNCH[] = {

    26,
    4 + 0,
    0,

                                                //      +-------------+
    ONE( ___XXX__, HMT0 ),                      // 00   |◼️◼️◼️🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXX__XX, HMT1 ),                      // 03   |🟩🟩🟩🟩◼️◼️🟩🟩|
    ONE( XXX__X_X, HMT1 ),                      // 04   |🟩🟩🟩◼️◼️🟩◼️🟩|
    ONE( X_X_X__X, HMT1 ),                      // 05   |🟩◼️🟩◼️🟩◼️◼️🟩|
    ONE( X_X_X__X, HMT1 ),                      // 06   |🟩◼️🟩◼️🟩◼️◼️🟩|
    ONE( X_X____X, HMT2 ),                      // 07   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( XXX____X, HMT2 ),                      // 08   |🟩🟩🟩◼️◼️◼️◼️🟩|
    ONE( XXX____X, HMT2 ),                      // 09   |🟩🟩🟩◼️◼️◼️◼️🟩|
    ONE( _XXX__X_, HMT3 ),                      // 10   |◼️🟩🟩🟩◼️◼️🟩◼️|
    ONE( _XXX__X_, HMT3 ),                      // 11   |◼️🟩🟩🟩◼️◼️🟩◼️|
    ONE( __XXXX__, HMT3 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, BDY1 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( XXXXXXXX, BDY0 ),                      // 14   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX_XX_XX, BDY1 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( X_XXXX_X, BDY2 ),                      // 16   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_XXXX_X, BDY2 ),                      // 17   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( _X_XX_X_, BDY2 ),                      // 18   |◼️🟩◼️🟩🟩◼️🟩◼️|
    ONE( _X____X_, BDY2 ),                      // 19   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( ___XX___, HMT1 ),                      // 20   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __XXXX__, HMT2 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, HMT2 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT2 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__XX_, HMT2 ),                      // 24   |◼️◼️🟩◼️◼️🟩🟩◼️|
    ONE( __X__X__, HMT0 ),                      // 25   |◼️◼️🟩◼️◼️🟩◼️◼️|
                                                //      +-------------+

};


const unsigned char shape_FRAME_PUSH[] = {

    SPRITE_DOUBLE | 25,
    4,
    0,
                                                //      +---------------------------+
    TWO( ___XXXX_, ________, HMT0, BONE ),      // 00   |◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __XXXXXX, ___XX___, HMT0, BONE ),      // 01   |◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️🟩🟩◼️◼️◼️|
    TWO( __XXXXXX, _____X__, HMT0, BONE ),      // 02   |◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️🟩◼️◼️|
    TWO( _XXXXX_X, X_____X_, HMT1, BONE ),      // 03   |◼️🟩🟩🟩🟩🟩◼️🟩🟩◼️◼️◼️◼️◼️🟩◼️|
    TWO( _XXXX___, X____XX_, HMT1, BONE ),      // 04   |◼️🟩🟩🟩🟩◼️◼️◼️🟩◼️◼️◼️◼️🟩🟩◼️|
    TWO( _XX_X_X_, X____X_X, HMT1, BONE ),      // 05   |◼️🟩🟩◼️🟩◼️🟩◼️🟩◼️◼️◼️◼️🟩◼️🟩|
    TWO( _XX_X_X_, X___X__X, HMT1, BONE ),      // 06   |◼️🟩🟩◼️🟩◼️🟩◼️🟩◼️◼️◼️🟩◼️◼️🟩|
    TWO( _XX_X___, X___X__X, HMT2, BONE ),      // 07   |◼️🟩🟩◼️🟩◼️◼️◼️🟩◼️◼️◼️🟩◼️◼️🟩|
    TWO( _XXXX___, X__X____, HMT2, BONE ),      // 08   |◼️🟩🟩🟩🟩◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️|
    TWO( _XXXX___, X__X____, HMT2, BONE ),      // 09   |◼️🟩🟩🟩🟩◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️|
    TWO( __XXXX_X, __X_____, HMT3, BONE ),      // 10   |◼️◼️🟩🟩🟩🟩◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️|
    TWO( __XXXX_X, __X_____, HMT3, BONE ),      // 11   |◼️◼️🟩🟩🟩🟩◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️|
    TWO( _X_XXXX_, ________, HMT3, BONE ),      // 12   |◼️🟩◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XX____X, X_______, BDY1, BONE ),      // 13   |◼️🟩🟩◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X_XX_XX, X_______, BDY0, BONE ),      // 14   |◼️🟩◼️🟩🟩◼️🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X_XX_XX, ________, BDY1, BONE ),      // 15   |◼️🟩◼️🟩🟩◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXX_X_, ________, BDY2, BONE ),      // 16   |◼️🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X_XXX__, ________, BDY2, BONE ),      // 17   |◼️🟩◼️🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X_XX_X_, ________, BDY2, BONE ),      // 18   |◼️🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X__XX__, ________, HMT1, BONE ),      // 19   |◼️🟩◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____XX__, ________, HMT2, BONE ),      // 20   |◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____XX__, ________, HMT2, BONE ),      // 21   |◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___XX___, ________, HMT2, BONE ),      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___XX___, ________, HMT2, BONE ),      // 23   |◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____XX__, ________, HMT0, BONE ),      // 24   |◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_PUSH2[] = {

    SPRITE_DOUBLE | 26,
    4,
    0,
                                                //      +---------------------------+
    TWO( ________, _XX_____, BONE, BONE ),      // 00   |◼️◼️◼️◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️|
    TWO( _______X, X_______, BONE, BONE ),      // 01   |◼️◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( __XXXX_X, ________, HMT0, BONE ),      // 02   |◼️◼️🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXXXX_, X_______, HMT0, BONE ),      // 03   |◼️🟩🟩🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXXXX_, X_______, HMT0, BONE ),      // 04   |◼️🟩🟩🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( XXXX__X_, X_______, HMT1, BONE ),      // 05   |🟩🟩🟩🟩◼️◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( XXX__X_X, _X______, HMT1, BONE ),      // 06   |🟩🟩🟩◼️◼️🟩◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( X_X_X__X, _X______, HMT1, BONE ),      // 07   |🟩◼️🟩◼️🟩◼️◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( X_X_X__X, _X______, HMT1, BONE ),      // 08   |🟩◼️🟩◼️🟩◼️◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( X_X____X, _X______, HMT2, BONE ),      // 09   |🟩◼️🟩◼️◼️◼️◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( XXX____X, ________, HMT2, BONE ),      // 10   |🟩🟩🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XXX____X, _X______, HMT2, BONE ),      // 11   |🟩🟩🟩◼️◼️◼️◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( _XXX__X_, _X______, HMT3, BONE ),      // 12   |◼️🟩🟩🟩◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( _XXX_X_X, ________, HMT3, BONE ),      // 13   |◼️🟩🟩🟩◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( X_XXXXXX, ________, HMT3, BONE ),      // 14   |🟩◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XX____XX, ________, BDY1, BONE ),      // 15   |🟩🟩◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( X_XX_XX_, ________, BDY0, BONE ),      // 16   |🟩◼️🟩🟩◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( X_XX_XX_, ________, BDY1, BONE ),      // 17   |🟩◼️🟩🟩◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXX___, ________, BDY2, BONE ),      // 18   |◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X_XX_X_, ________, BDY2, BONE ),      // 19   |◼️🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X_XX_X_, ________, HMT1, BONE ),      // 20   |◼️🟩◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X__XX__, ________, HMT2, BONE ),      // 21   |◼️🟩◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____XX__, ________, HMT2, BONE ),      // 22   |◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____XX__, ________, HMT2, BONE ),      // 23   |◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___XX___, ________, HMT2, BONE ),      // 24   |◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___XXX__, ________, HMT0, BONE ),      // 25   |◼️◼️◼️🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_WALK1[] = {

    26,
    5,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXX_XX, HMT1 ),                      // 03   |🟩🟩🟩🟩🟩◼️🟩🟩|
    ONE( XXXX___X, HMT1 ),                      // 04   |🟩🟩🟩🟩◼️◼️◼️🟩|
    ONE( XX_X_X_X, HMT1 ),                      // 05   |🟩🟩◼️🟩◼️🟩◼️🟩|
    ONE( XX_X_X_X, HMT1 ),                      // 06   |🟩🟩◼️🟩◼️🟩◼️🟩|
    ONE( XX_X___X, HMT2 ),                      // 07   |🟩🟩◼️🟩◼️◼️◼️🟩|
    ONE( XXXX___X, HMT2 ),                      // 08   |🟩🟩🟩🟩◼️◼️◼️🟩|
    ONE( XXXX___X, HMT2 ),                      // 09   |🟩🟩🟩🟩◼️◼️◼️🟩|
    ONE( _XXXX_X_, HMT3 ),                      // 10   |◼️🟩🟩🟩🟩◼️🟩◼️|
    ONE( _XXXX_X_, HMT3 ),                      // 11   |◼️🟩🟩🟩🟩◼️🟩◼️|
    ONE( X_XXXX__, HMT3 ),                      // 12   |🟩◼️🟩🟩🟩🟩◼️◼️|
    ONE( XX______, BDY0 ),                      // 13   |🟩🟩◼️◼️◼️◼️◼️◼️|
    ONE( X_XX_X__, BDY1 ),                      // 14   |🟩◼️🟩🟩◼️🟩◼️◼️|
    ONE( X_XX_X__, BDY2 ),                      // 15   |🟩◼️🟩🟩◼️🟩◼️◼️|
    ONE( XXXX_X__, BDY2 ),                      // 16   |🟩🟩🟩🟩◼️🟩◼️◼️|
    ONE( X_XX____, BDY2 ),                      // 17   |🟩◼️🟩🟩◼️◼️◼️◼️|
    ONE( X_XX_X__, BDY2 ),                      // 18   |🟩◼️🟩🟩◼️🟩◼️◼️|
    ONE( X_XX_X__, HMT2 ),                      // 19   |🟩◼️🟩🟩◼️🟩◼️◼️|
    ONE( X_X_X___, HMT2 ),                      // 20   |🟩◼️🟩◼️🟩◼️◼️◼️|
    ONE( ___XX___, HMT2 ),                      // 21   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( ___XX___, HMT2 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __XX____, HMT2 ),                      // 23   |◼️◼️🟩🟩◼️◼️◼️◼️|
    ONE( __XX____, HMT2 ),                      // 24   |◼️◼️🟩🟩◼️◼️◼️◼️|
    ONE( __XXX___, HMT0 ),                      // 25   |◼️◼️🟩🟩🟩◼️◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_WALK2[] = {

    24,
    3,
    3,
                                                //      +-------------+
    ONE( ___XXX__, HMT0 ),                      // 00   |◼️◼️◼️🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXX_XX, HMT1 ),                      // 03   |🟩🟩🟩🟩🟩◼️🟩🟩|
    ONE( XXXXX__X, HMT1 ),                      // 04   |🟩🟩🟩🟩🟩◼️◼️🟩|
    ONE( XXX_X_XX, HMT1 ),                      // 05   |🟩🟩🟩◼️🟩◼️🟩🟩|
    ONE( XXX_X_XX, HMT1 ),                      // 06   |🟩🟩🟩◼️🟩◼️🟩🟩|
    ONE( XXX_X__X, HMT2 ),                      // 07   |🟩🟩🟩◼️🟩◼️◼️🟩|
    ONE( XXXXX__X, HMT2 ),                      // 08   |🟩🟩🟩🟩🟩◼️◼️🟩|
    ONE( XXXXX__X, HMT2 ),                      // 09   |🟩🟩🟩🟩🟩◼️◼️🟩|
    ONE( _XXXX_X_, HMT3 ),                      // 10   |◼️🟩🟩🟩🟩◼️🟩◼️|
    ONE( _XXXX_X_, HMT3 ),                      // 11   |◼️🟩🟩🟩🟩◼️🟩◼️|
    ONE( __X_XX__, HMT3 ),                      // 12   |◼️◼️🟩◼️🟩🟩◼️◼️|
    ONE( XX___XX_, BDY1 ),                      // 13   |🟩🟩◼️◼️◼️🟩🟩◼️|
    ONE( XX_XXXX_, BDY0 ),                      // 14   |🟩🟩◼️🟩🟩🟩🟩◼️|
    ONE( XX_XXXX_, BDY1 ),                      // 15   |🟩🟩◼️🟩🟩🟩🟩◼️|
    ONE( XXX_XX__, BDY2 ),                      // 16   |🟩🟩🟩◼️🟩🟩◼️◼️|
    ONE( X_XX____, BDY2 ),                      // 17   |🟩◼️🟩🟩◼️◼️◼️◼️|
    ONE( _X______, BDY2 ),                      // 18   |◼️🟩◼️◼️◼️◼️◼️◼️|
    ONE( _X_XXX_X, HMT1 ),                      // 19   |◼️🟩◼️🟩🟩🟩◼️🟩|
    ONE( XXXX_XXX, HMT2 ),                      // 20   |🟩🟩🟩🟩◼️🟩🟩🟩|
    ONE( XXX__XXX, HMT2 ),                      // 21   |🟩🟩🟩◼️◼️🟩🟩🟩|
    ONE( X_X___X_, HMT2 ),                      // 22   |🟩◼️🟩◼️◼️◼️🟩◼️|
    ONE( ______X_, HMT0 ),                      // 23   |◼️◼️◼️◼️◼️◼️🟩◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_WALK3[] = {

    26,
    4,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXX_XX, HMT1 ),                      // 03   |🟩🟩🟩🟩🟩◼️🟩🟩|
    ONE( XXXX___X, HMT1 ),                      // 04   |🟩🟩🟩🟩◼️◼️◼️🟩|
    ONE( XX_X_X_X, HMT1 ),                      // 05   |🟩🟩◼️🟩◼️🟩◼️🟩|
    ONE( XX_X_X_X, HMT1 ),                      // 06   |🟩🟩◼️🟩◼️🟩◼️🟩|
    ONE( XX_X___X, HMT2 ),                      // 07   |🟩🟩◼️🟩◼️◼️◼️🟩|
    ONE( XXXX___X, HMT2 ),                      // 08   |🟩🟩🟩🟩◼️◼️◼️🟩|
    ONE( XXXX___X, HMT2 ),                      // 09   |🟩🟩🟩🟩◼️◼️◼️🟩|
    ONE( _XXXX_X_, HMT3 ),                      // 10   |◼️🟩🟩🟩🟩◼️🟩◼️|
    ONE( _XXXX_X_, HMT3 ),                      // 11   |◼️🟩🟩🟩🟩◼️🟩◼️|
    ONE( X_XXXX__, HMT3 ),                      // 12   |🟩◼️🟩🟩🟩🟩◼️◼️|
    ONE( XX______, BDY1 ),                      // 13   |🟩🟩◼️◼️◼️◼️◼️◼️|
    ONE( X_XX_X__, BDY0 ),                      // 14   |🟩◼️🟩🟩◼️🟩◼️◼️|
    ONE( X_XX_X__, BDY1 ),                      // 15   |🟩◼️🟩🟩◼️🟩◼️◼️|
    ONE( XXXX_X__, BDY2 ),                      // 16   |🟩🟩🟩🟩◼️🟩◼️◼️|
    ONE( X_XX____, BDY2 ),                      // 17   |🟩◼️🟩🟩◼️◼️◼️◼️|
    ONE( X_XX_X__, BDY2 ),                      // 18   |🟩◼️🟩🟩◼️🟩◼️◼️|
    ONE( X_XX_X__, BDY2 ),                      // 19   |🟩◼️🟩🟩◼️🟩◼️◼️|
    ONE( X_X_X___, HMT1 ),                      // 20   |🟩◼️🟩◼️🟩◼️◼️◼️|
    ONE( ___XX___, HMT2 ),                      // 21   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( ___XX___, HMT2 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __XX____, HMT2 ),                      // 23   |◼️◼️🟩🟩◼️◼️◼️◼️|
    ONE( __XX____, HMT2 ),                      // 24   |◼️◼️🟩🟩◼️◼️◼️◼️|
    ONE( __XXX___, HMT0 ),                      // 25   |◼️◼️🟩🟩🟩◼️◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_WALK4[] = {

    24,
    3,
    3,
                                                //      +-------------+
    ONE( ___XXX__, HMT0 ),                      // 00   |◼️◼️◼️🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXX__XX, HMT1 ),                      // 03   |🟩🟩🟩🟩◼️◼️🟩🟩|
    ONE( XXX__X_X, HMT1 ),                      // 04   |🟩🟩🟩◼️◼️🟩◼️🟩|
    ONE( X_X_X__X, HMT1 ),                      // 05   |🟩◼️🟩◼️🟩◼️◼️🟩|
    ONE( X_X_X__X, HMT1 ),                      // 06   |🟩◼️🟩◼️🟩◼️◼️🟩|
    ONE( X_X____X, HMT2 ),                      // 07   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( XXX____X, HMT2 ),                      // 08   |🟩🟩🟩◼️◼️◼️◼️🟩|
    ONE( XXX____X, HMT2 ),                      // 09   |🟩🟩🟩◼️◼️◼️◼️🟩|
    ONE( _XXX__X_, HMT3 ),                      // 10   |◼️🟩🟩🟩◼️◼️🟩◼️|
    ONE( _XXX__X_, HMT3 ),                      // 11   |◼️🟩🟩🟩◼️◼️🟩◼️|
    ONE( X_XXXX__, HMT3 ),                      // 12   |🟩◼️🟩🟩🟩🟩◼️◼️|
    ONE( XX_____X, BDY1 ),                      // 13   |🟩🟩◼️◼️◼️◼️◼️🟩|
    ONE( _XXX_X_X, BDY0 ),                      // 14   |◼️🟩🟩🟩◼️🟩◼️🟩|
    ONE( XXXX_X_X, BDY1 ),                      // 15   |🟩🟩🟩🟩◼️🟩◼️🟩|
    ONE( XXXX_X__, BDY2 ),                      // 16   |🟩🟩🟩🟩◼️🟩◼️◼️|
    ONE( _XX_____, BDY2 ),                      // 17   |◼️🟩🟩◼️◼️◼️◼️◼️|
    ONE( _____X__, HMT1 ),                      // 18   |◼️◼️◼️◼️◼️🟩◼️◼️|
    ONE( _X_X_X_X, HMT2 ),                      // 19   |◼️🟩◼️🟩◼️🟩◼️🟩|
    ONE( XXXXXXXX, HMT2 ),                      // 20   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXX_XXX, HMT2 ),                      // 21   |🟩🟩🟩🟩◼️🟩🟩🟩|
    ONE( X_X___X_, HMT2 ),                      // 22   |🟩◼️🟩◼️◼️◼️🟩◼️|
    ONE( ______X_, HMT0 ),                      // 23   |◼️◼️◼️◼️◼️◼️🟩◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_SKELETON1[] = {

    SPRITE_DOUBLE | SPRITE_ABSCOLOUR | 20,
    0,
    0,
                                                //      +---------------------------+
    TWO( _____XXX, X_______, BONE, BONE ),      // 00   |◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____XXXX, XX______, BONE, BONE ),      // 01   |◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( ____X__X, __X_____, BONE, BONE ),      // 02   |◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️|
    TWO( ____X__X, __X_____, BONE, BONE ),      // 03   |◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️|
    TWO( ____XXXX, XX______, BONE, BONE ),      // 04   |◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( _____X_X, _X______, BONE, BONE ),      // 05   |◼️◼️◼️◼️◼️🟩◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( ______X_, X_______, BONE, BONE ),      // 06   |◼️◼️◼️◼️◼️◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( _______X, ________, BONE, BONE ),      // 07   |◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____XXXX, XX______, BONE, BONE ),      // 08   |◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( ___X___X, __X_____, BONE, BONE ),      // 09   |◼️◼️◼️🟩◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️|
    TWO( __XX_XXX, X_XX____, BONE, BONE ),      // 10   |◼️◼️🟩🟩◼️🟩🟩🟩🟩◼️🟩🟩◼️◼️◼️◼️|
    TWO( __X____X, ___X____, BONE, BONE ),      // 11   |◼️◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️🟩◼️◼️◼️◼️|
    TWO( _____XXX, XX______, BONE, BONE ),      // 12   |◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( __XX__XX, X_XX____, BONE, BONE ),      // 13   |◼️◼️🟩🟩◼️◼️🟩🟩🟩◼️🟩🟩◼️◼️◼️◼️|
    TWO( _X___X_X, _X__X___, BONE, BONE ),      // 14   |◼️🟩◼️◼️◼️🟩◼️🟩◼️🟩◼️◼️🟩◼️◼️◼️|
    TWO( _____X__, _X______, BONE, BONE ),      // 15   |◼️◼️◼️◼️◼️🟩◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( ____XX__, _XX_____, BONE, BONE ),      // 16   |◼️◼️◼️◼️🟩🟩◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️|
    TWO( _____X__, _X______, BONE, BONE ),      // 17   |◼️◼️◼️◼️◼️🟩◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( ________, ________, BONE, BONE ),      // 18   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____XXX_, XXX_____, BONE, BONE ),      // 19   |◼️◼️◼️◼️🟩🟩🟩◼️🟩🟩🟩◼️◼️◼️◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_SKELETON2[] = {

    SPRITE_DOUBLE | SPRITE_ABSCOLOUR | 20,
    1,
    0,
                                                //      +---------------------------+
    TWO( ____XXXX, ________, BONE, BONE ),      // 00   |◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___XXXXX, X_______, BONE, BONE ),      // 01   |◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( __X__X__, X_______, BONE, BONE ),      // 02   |◼️◼️🟩◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( __X__X__, X_______, BONE, BONE ),      // 03   |◼️◼️🟩◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( __XXXXXX, X_______, BONE, BONE ),      // 04   |◼️◼️🟩🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___X_X_X, ________, BONE, BONE ),      // 05   |◼️◼️◼️🟩◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____X_X_, ________, BONE, BONE ),      // 06   |◼️◼️◼️◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _______X, ________, BONE, BONE ),      // 07   |◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___XXXXX, X_______, BONE, BONE ),      // 08   |◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( __X___X_, _X______, BONE, BONE ),      // 09   |◼️◼️🟩◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( _XX_XXXX, _XX_____, BONE, BONE ),      // 10   |◼️🟩🟩◼️🟩🟩🟩🟩◼️🟩🟩◼️◼️◼️◼️◼️|
    TWO( _X____X_, __X_____, BONE, BONE ),      // 11   |◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️🟩◼️◼️◼️◼️◼️|
    TWO( ____XXXX, X_______, BONE, BONE ),      // 12   |◼️◼️◼️◼️🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XX__XXX, _XX_____, BONE, BONE ),      // 13   |◼️🟩🟩◼️◼️🟩🟩🟩◼️🟩🟩◼️◼️◼️◼️◼️|
    TWO( X___X_X_, X__X____, BONE, BONE ),      // 14   |🟩◼️◼️◼️🟩◼️🟩◼️🟩◼️◼️🟩◼️◼️◼️◼️|
    TWO( ____X___, X_______, BONE, BONE ),      // 15   |◼️◼️◼️◼️🟩◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___XX___, XX______, BONE, BONE ),      // 16   |◼️◼️◼️🟩🟩◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( ____X___, X_______, BONE, BONE ),      // 17   |◼️◼️◼️◼️🟩◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ________, ________, BONE, BONE ),      // 18   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___XXX_X, XX______, BONE, BONE ),      // 19   |◼️◼️◼️🟩🟩🟩◼️🟩🟩🟩◼️◼️◼️◼️◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_SKELETON3[] = {

    SPRITE_DOUBLE | SPRITE_ABSCOLOUR | 16,
    0,
    0,
                                                //      +---------------------------+
    TWO( _______X, XXX_____, BONE, BONE ),      // 00   |◼️◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️|
    TWO( ______XX, XXXX____, BONE, BONE ),      // 01   |◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️|
    TWO( ______X_, _X__X___, BONE, BONE ),      // 02   |◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️🟩◼️◼️◼️|
    TWO( ______X_, _X__X___, BONE, BONE ),      // 03   |◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️🟩◼️◼️◼️|
    TWO( ______XX, XXXX____, BONE, BONE ),      // 04   |◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️|
    TWO( _______X, _X_X____, BONE, BONE ),      // 05   |◼️◼️◼️◼️◼️◼️◼️🟩◼️🟩◼️🟩◼️◼️◼️◼️|
    TWO( ________, X_X_____, BONE, BONE ),      // 06   |◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️🟩◼️◼️◼️◼️◼️|
    TWO( __X_XXX_, XXX_____, BONE, BONE ),      // 07   |◼️◼️🟩◼️🟩🟩🟩◼️🟩🟩🟩◼️◼️◼️◼️◼️|
    TWO( _X____X_, ________, BONE, BONE ),      // 08   |◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X__XXXX, ___X____, BONE, BONE ),      // 09   |◼️🟩◼️◼️🟩🟩🟩🟩◼️◼️◼️🟩◼️◼️◼️◼️|
    TWO( ______XX, __XX____, BONE, BONE ),      // 10   |◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️🟩🟩◼️◼️◼️◼️|
    TWO( _X__X_X_, X_______, BONE, BONE ),      // 11   |◼️🟩◼️◼️🟩◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X__X___, X___XX__, BONE, BONE ),      // 12   |◼️🟩◼️◼️🟩◼️◼️◼️🟩◼️◼️◼️🟩🟩◼️◼️|
    TWO( _X__X___, X___X___, BONE, BONE ),      // 13   |◼️🟩◼️◼️🟩◼️◼️◼️🟩◼️◼️◼️🟩◼️◼️◼️|
    TWO( X_______, ________, BONE, BONE ),      // 14   |🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___XXX_X, XX______, BONE, BONE ),      // 15   |◼️◼️◼️🟩🟩🟩◼️🟩🟩🟩◼️◼️◼️◼️◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_SKELETON4[] = {

    SPRITE_DOUBLE | SPRITE_ABSCOLOUR | 12,
    -1,
    0,
                                                //      +---------------------------+
    TWO( ________, XXXX____, BONE, BONE ),      // 00   |◼️◼️◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️|
    TWO( _______X, XXXXX___, BONE, BONE ),      // 01   |◼️◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️|
    TWO( _______X, __X__X__, BONE, BONE ),      // 02   |◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️🟩◼️◼️|
    TWO( _______X, __X__X__, BONE, BONE ),      // 03   |◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️🟩◼️◼️|
    TWO( _______X, XXXXX___, BONE, BONE ),      // 04   |◼️◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️|
    TWO( ________, X_X_X___, BONE, BONE ),      // 05   |◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️🟩◼️🟩◼️◼️◼️|
    TWO( ________, _X_X____, BONE, BONE ),      // 06   |◼️◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️🟩◼️◼️◼️◼️|
    TWO( _____X__, XXXX____, BONE, BONE ),      // 07   |◼️◼️◼️◼️◼️🟩◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️|
    TWO( ___X___X, ________, BONE, BONE ),      // 08   |◼️◼️◼️🟩◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _______X, XX______, BONE, BONE ),      // 09   |◼️◼️◼️◼️◼️◼️◼️🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( ___X__X_, ______X_, BONE, BONE ),      // 10   |◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️🟩◼️|
    TWO( __XX__XX, X_XXX__X, BONE, BONE ),      // 11   |◼️◼️🟩🟩◼️◼️🟩🟩🟩◼️🟩🟩🟩◼️◼️🟩|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_SKELETON5[] = {

    3,
    6,
    0,
                                                //      +-------------+
    ONE( _XXXXXX_, BONE ),                      // 00   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( X__X__XX, BONE ),                      // 01   |🟩◼️◼️🟩◼️◼️🟩🟩|
    ONE( XX_XX__X, BONE ),                      // 02   |🟩🟩◼️🟩🟩◼️◼️🟩|
                                                //      +-------------+
};


const unsigned char shape_FRAME_WALKUP0[] = {

    26,
    3,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT1 ),                      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT1 ),                      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( X_XXXX_X, HMT1 ),                      // 05   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_XXXX_X, HMT1 ),                      // 06   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_XXXX_X, HMT2 ),                      // 07   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( XXXXXXXX, HMT2 ),                      // 08   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT2 ),                      // 09   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( _XXXXXX_, HMT3 ),                      // 10   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _X____X_, HMT3 ),                      // 11   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( __XXXX__, HMT3 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( __XXXX__, BDY1 ),                      // 13   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, BDY0 ),                      // 14   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( X_XXXX_X, BDY1 ),                      // 15   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( XXXXXXXX, BDY2 ),                      // 16   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX____XX, BDY2 ),                      // 17   |🟩🟩◼️◼️◼️◼️🟩🟩|
    ONE( X_XXXX_X, BDY2 ),                      // 18   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_XXXX_X, BDY2 ),                      // 19   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X______X, BDY2 ),                      // 20   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( __XXXX__, HMT1 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, HMT2 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT2 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT2 ),                      // 24   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 25   |◼️◼️🟩◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_WALKUP1[] = {

    25,
    3,
    2,
                                                //      +-------------+
    ONE( ___XXX__, HMT0 ),                      // 00   |◼️◼️◼️🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT1 ),                      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT1 ),                      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( _XXXX_XX, HMT1 ),                      // 05   |◼️🟩🟩🟩🟩◼️🟩🟩|
    ONE( _XXXX_XX, HMT1 ),                      // 06   |◼️🟩🟩🟩🟩◼️🟩🟩|
    ONE( _XXXX_XX, HMT2 ),                      // 07   |◼️🟩🟩🟩🟩◼️🟩🟩|
    ONE( XXXXXXXX, HMT2 ),                      // 08   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT2 ),                      // 09   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( _____XXX, HMT3 ),                      // 10   |◼️◼️◼️◼️◼️🟩🟩🟩|
    ONE( _XXXX_X_, HMT3 ),                      // 11   |◼️🟩🟩🟩🟩◼️🟩◼️|
    ONE( _XXXXX__, HMT3 ),                      // 12   |◼️🟩🟩🟩🟩🟩◼️◼️|
    ONE( X____X__, BDY1 ),                      // 13   |🟩◼️◼️◼️◼️🟩◼️◼️|
    ONE( XXXXX___, BDY0 ),                      // 14   |🟩🟩🟩🟩🟩◼️◼️◼️|
    ONE( XXXXX_X_, BDY1 ),                      // 15   |🟩🟩🟩🟩🟩◼️🟩◼️|
    ONE( ______X_, BDY2 ),                      // 16   |◼️◼️◼️◼️◼️◼️🟩◼️|
    ONE( _XXXX_X_, BDY2 ),                      // 17   |◼️🟩🟩🟩🟩◼️🟩◼️|
    ONE( _XXXXX__, BDY2 ),                      // 18   |◼️🟩🟩🟩🟩🟩◼️◼️|
    ONE( ___X____, BDY2 ),                      // 19   |◼️◼️◼️🟩◼️◼️◼️◼️|
    ONE( __X_X___, HMT1 ),                      // 20   |◼️◼️🟩◼️🟩◼️◼️◼️|
    ONE( _XXX_X__, HMT2 ),                      // 21   |◼️🟩🟩🟩◼️🟩◼️◼️|
    ONE( _XX__X__, HMT2 ),                      // 22   |◼️🟩🟩◼️◼️🟩◼️◼️|
    ONE( _XX_____, HMT2 ),                      // 23   |◼️🟩🟩◼️◼️◼️◼️◼️|
    ONE( __X_____, HMT0 ),                      // 24   |◼️◼️🟩◼️◼️◼️◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_WALKUP2[] = {

    26,
    3,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT1 ),                      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT1 ),                      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( X_XXXX_X, HMT1 ),                      // 05   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_XXXX_X, HMT1 ),                      // 06   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_XXXX_X, HMT2 ),                      // 07   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( XXXXXXXX, HMT2 ),                      // 08   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT2 ),                      // 09   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( _XXXXXX_, HMT3 ),                      // 10   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _X____X_, HMT3 ),                      // 11   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( __XXXX__, HMT3 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( __XXXX__, BDY1 ),                      // 13   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, BDY0 ),                      // 14   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( X_XXXX_X, BDY1 ),                      // 15   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( XXXXXXXX, BDY2 ),                      // 16   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX____XX, BDY2 ),                      // 17   |🟩🟩◼️◼️◼️◼️🟩🟩|
    ONE( X_XXXX_X, BDY2 ),                      // 18   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_XXXX_X, BDY2 ),                      // 19   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X______X, BDY2 ),                      // 20   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( __XXXX__, HMT1 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, HMT2 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT2 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT2 ),                      // 24   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 25   |◼️◼️🟩◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_WALKUP3[] = {

    25,
    3,
    2,
                                                //      +-------------+
    ONE( __XXX___, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩◼️◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT1 ),                      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT1 ),                      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX_XXXX_, HMT1 ),                      // 05   |🟩🟩◼️🟩🟩🟩🟩◼️|
    ONE( XX_XXXX_, HMT1 ),                      // 06   |🟩🟩◼️🟩🟩🟩🟩◼️|
    ONE( XX_XXXX_, HMT2 ),                      // 07   |🟩🟩◼️🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT2 ),                      // 08   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT2 ),                      // 09   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXX_____, HMT3 ),                      // 10   |🟩🟩🟩◼️◼️◼️◼️◼️|
    ONE( _X_XXXX_, HMT3 ),                      // 11   |◼️🟩◼️🟩🟩🟩🟩◼️|
    ONE( __XXXXX_, HMT3 ),                      // 12   |◼️◼️🟩🟩🟩🟩🟩◼️|
    ONE( __X____X, BDY1 ),                      // 13   |◼️◼️🟩◼️◼️◼️◼️🟩|
    ONE( ___XXXXX, BDY0 ),                      // 14   |◼️◼️◼️🟩🟩🟩🟩🟩|
    ONE( _X_XXXXX, BDY1 ),                      // 15   |◼️🟩◼️🟩🟩🟩🟩🟩|
    ONE( _X______, BDY2 ),                      // 16   |◼️🟩◼️◼️◼️◼️◼️◼️|
    ONE( _X_XXXX_, BDY2 ),                      // 17   |◼️🟩◼️🟩🟩🟩🟩◼️|
    ONE( __XXXXX_, BDY2 ),                      // 18   |◼️◼️🟩🟩🟩🟩🟩◼️|
    ONE( ____X___, BDY2 ),                      // 19   |◼️◼️◼️◼️🟩◼️◼️◼️|
    ONE( ___X_X__, HMT1 ),                      // 20   |◼️◼️◼️🟩◼️🟩◼️◼️|
    ONE( __X_XXX_, HMT2 ),                      // 21   |◼️◼️🟩◼️🟩🟩🟩◼️|
    ONE( __X__XX_, HMT2 ),                      // 22   |◼️◼️🟩◼️◼️🟩🟩◼️|
    ONE( _____XX_, HMT2 ),                      // 23   |◼️◼️◼️◼️◼️🟩🟩◼️|
    ONE( _____X__, HMT0 ),                      // 24   |◼️◼️◼️◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_WALKDOWN0[] = {

    26,
    3,
    0,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT1 ),                      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT1 ),                      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX_X__XX, HMT1 ),                      // 05   |🟩🟩◼️🟩◼️◼️🟩🟩|
    ONE( XXX___XX, HMT1 ),                      // 06   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( X_X____X, HMT2 ),                      // 07   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( X______X, HMT2 ),                      // 08   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT2 ),                      // 09   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT3 ),                      // 10   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _X____X_, HMT3 ),                      // 11   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( __XXXX__, HMT3 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, BDY1 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XXXXXX_, BDY0 ),                      // 14   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XX_XX, BDY2 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XX_XX_XX, BDY2 ),                      // 16   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XXXXXXXX, BDY2 ),                      // 17   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( X_XXXX_X, BDY2 ),                      // 18   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_X__X_X, BDY2 ),                      // 19   |🟩◼️🟩◼️◼️🟩◼️🟩|
    ONE( X__XX__X, BDY2 ),                      // 20   |🟩◼️◼️🟩🟩◼️◼️🟩|
    ONE( __XXXX__, BDY2 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, BDY2 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT1 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT2 ),                      // 24   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 25   |◼️◼️🟩◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_WALKDOWN1[] = {

    25,
    3,
    3,
                                                //      +-------------+
    ONE( __XXX___, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩◼️◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT1 ),                      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT1 ),                      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX___XXX, HMT1 ),                      // 05   |🟩🟩◼️◼️◼️🟩🟩🟩|
    ONE( X_X__XXX, HMT1 ),                      // 06   |🟩◼️🟩◼️◼️🟩🟩🟩|
    ONE( X_X___XX, HMT2 ),                      // 07   |🟩◼️🟩◼️◼️◼️🟩🟩|
    ONE( X_____XX, HMT2 ),                      // 08   |🟩◼️◼️◼️◼️◼️🟩🟩|
    ONE( X_____XX, HMT2 ),                      // 09   |🟩◼️◼️◼️◼️◼️🟩🟩|
    ONE( _X___XX_, HMT3 ),                      // 10   |◼️🟩◼️◼️◼️🟩🟩◼️|
    ONE( _X___XX_, HMT3 ),                      // 11   |◼️🟩◼️◼️◼️🟩🟩◼️|
    ONE( __XXXX__, HMT3 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ______X_, BDY1 ),                      // 13   |◼️◼️◼️◼️◼️◼️🟩◼️|
    ONE( _XXXXXXX, BDY1 ),                      // 14   |◼️🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX_XX_XX, BDY0 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XX_X_X_X, BDY1 ),                      // 16   |🟩🟩◼️🟩◼️🟩◼️🟩|
    ONE( X_XX_XXX, BDY2 ),                      // 17   |🟩◼️🟩🟩◼️🟩🟩🟩|
    ONE( __XX_XX_, BDY2 ),                      // 18   |◼️◼️🟩🟩◼️🟩🟩◼️|
    ONE( ___X_XX_, BDY2 ),                      // 19   |◼️◼️◼️🟩◼️🟩🟩◼️|
    ONE( __X_X___, BDY2 ),                      // 20   |◼️◼️🟩◼️🟩◼️◼️◼️|
    ONE( _XXX_X__, HMT1 ),                      // 21   |◼️🟩🟩🟩◼️🟩◼️◼️|
    ONE( _XX__X__, HMT2 ),                      // 22   |◼️🟩🟩◼️◼️🟩◼️◼️|
    ONE( _XX_____, HMT2 ),                      // 23   |◼️🟩🟩◼️◼️◼️◼️◼️|
    ONE( __X_____, HMT0 ),                      // 24   |◼️◼️🟩◼️◼️◼️◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_WALKDOWN2[] = {

    26,
    3,
    3,
                                                //      +-------------+
    ONE( __XXXX__, HMT0 ),                      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT1 ),                      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT1 ),                      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XX_X__XX, HMT1 ),                      // 05   |🟩🟩◼️🟩◼️◼️🟩🟩|
    ONE( XXX___XX, HMT1 ),                      // 06   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( X_X____X, HMT2 ),                      // 07   |🟩◼️🟩◼️◼️◼️◼️🟩|
    ONE( X______X, HMT2 ),                      // 08   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( X______X, HMT2 ),                      // 09   |🟩◼️◼️◼️◼️◼️◼️🟩|
    ONE( _X____X_, HMT3 ),                      // 10   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _X____X_, HMT3 ),                      // 11   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( __XXXX__, HMT3 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X____X_, BDY1 ),                      // 13   |◼️🟩◼️◼️◼️◼️🟩◼️|
    ONE( _XXXXXX_, BDY0 ),                      // 14   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XX_XX, BDY1 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XX_XX_XX, BDY2 ),                      // 16   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( XXXXXXXX, BDY2 ),                      // 17   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( X_XXXX_X, BDY2 ),                      // 18   |🟩◼️🟩🟩🟩🟩◼️🟩|
    ONE( X_X__X_X, BDY2 ),                      // 19   |🟩◼️🟩◼️◼️🟩◼️🟩|
    ONE( X__XX__X, BDY2 ),                      // 20   |🟩◼️◼️🟩🟩◼️◼️🟩|
    ONE( __XXXX__, BDY2 ),                      // 21   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( ___XX___, BDY2 ),                      // 22   |◼️◼️◼️🟩🟩◼️◼️◼️|
    ONE( __X__X__, HMT1 ),                      // 23   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT2 ),                      // 24   |◼️◼️🟩◼️◼️🟩◼️◼️|
    ONE( __X__X__, HMT0 ),                      // 25   |◼️◼️🟩◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_WALKDOWN3[] = {

    25,
    3,
    3,
                                                //      +-------------+
    ONE( ___XXX__, HMT0 ),                      // 00   |◼️◼️◼️🟩🟩🟩◼️◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( _XXXXXX_, HMT0 ),                      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️|
    ONE( XXXXXXXX, HMT1 ),                      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXXXXXXX, HMT1 ),                      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩|
    ONE( XXX___XX, HMT1 ),                      // 05   |🟩🟩🟩◼️◼️◼️🟩🟩|
    ONE( XXXX___X, HMT1 ),                      // 06   |🟩🟩🟩🟩◼️◼️◼️🟩|
    ONE( XX_X___X, HMT2 ),                      // 07   |🟩🟩◼️🟩◼️◼️◼️🟩|
    ONE( XX_____X, HMT2 ),                      // 08   |🟩🟩◼️◼️◼️◼️◼️🟩|
    ONE( XX_____X, HMT2 ),                      // 09   |🟩🟩◼️◼️◼️◼️◼️🟩|
    ONE( _XX___X_, HMT3 ),                      // 10   |◼️🟩🟩◼️◼️◼️🟩◼️|
    ONE( _XX___X_, HMT3 ),                      // 11   |◼️🟩🟩◼️◼️◼️🟩◼️|
    ONE( __XXXX__, HMT3 ),                      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️|
    ONE( _X______, BDY1 ),                      // 13   |◼️🟩◼️◼️◼️◼️◼️◼️|
    ONE( XXXXXXX_, BDY0 ),                      // 14   |🟩🟩🟩🟩🟩🟩🟩◼️|
    ONE( XX_XX_XX, BDY1 ),                      // 15   |🟩🟩◼️🟩🟩◼️🟩🟩|
    ONE( X_X_X_XX, BDY2 ),                      // 16   |🟩◼️🟩◼️🟩◼️🟩🟩|
    ONE( XXX_XX_X, BDY2 ),                      // 17   |🟩🟩🟩◼️🟩🟩◼️🟩|
    ONE( _XX_XX__, BDY2 ),                      // 18   |◼️🟩🟩◼️🟩🟩◼️◼️|
    ONE( _XX_X___, BDY2 ),                      // 19   |◼️🟩🟩◼️🟩◼️◼️◼️|
    ONE( ___X_X__, BDY2 ),                      // 20   |◼️◼️◼️🟩◼️🟩◼️◼️|
    ONE( __X_XXX_, HMT1 ),                      // 21   |◼️◼️🟩◼️🟩🟩🟩◼️|
    ONE( __X__XX_, HMT2 ),                      // 22   |◼️◼️🟩◼️◼️🟩🟩◼️|
    ONE( _____XX_, HMT2 ),                      // 23   |◼️◼️◼️◼️◼️🟩🟩◼️|
    ONE( _____X__, HMT0 ),                      // 24   |◼️◼️◼️◼️◼️🟩◼️◼️|
                                                //      +-------------+
};


const unsigned char shape_FRAME_MINE_UP_0[] = {

    SPRITE_DOUBLE | 31,
    0,
    0,
                                                //      +---------------------------+
    TWO( ________, XX______, BONE, BONE ),      // 00   |◼️◼️◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( _______X, X_______, BONE, BONE ),      // 00   |◼️◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ______XX, X_______, BONE, BONE ),      // 01   |◼️◼️◼️◼️◼️◼️🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( _____X_X, X_______, BONE, BONE ),      // 02   |◼️◼️◼️◼️◼️🟩◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ________, X_______, BONE, BONE ),      // 03   |◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ________, X_______, BONE, BONE ),      // 04   |◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ______XX, XX______, HMT0, HMT0 ),      // 05   |◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( _____XXX, XXX_____, HMT0, HMT0 ),      // 06   |◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️|
    TWO( _____XXX, XXX_____, HMT0, HMT0 ),      // 07   |◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️|
    TWO( ____XXXX, XXXX____, HMT1, HMT1 ),      // 08   |◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️|
    TWO( ____XXXX, XXXX____, HMT1, HMT1 ),      // 09   |◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️|
    TWO( ____X_XX, XX_X____, HMT1, HMT1 ),      // 10   |◼️◼️◼️◼️🟩◼️🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️|
    TWO( ____X_XX, XX_X____, HMT2, HMT2 ),      // 11   |◼️◼️◼️◼️🟩◼️🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️|
    TWO( ____X_XX, XX_X____, HMT2, HMT2 ),      // 12   |◼️◼️◼️◼️🟩◼️🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️|
    TWO( ____XXXX, XXXX____, HMT2, HMT2 ),      // 13   |◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️|
    TWO( ____XXXX, XXXX____, HMT3, HMT3 ),      // 14   |◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️|
    TWO( _____XXX, XXX_____, HMT3, HMT3 ),      // 15   |◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️|
    TWO( ____XX__, __X_____, BDY0, BDY1 ),      // 16   |◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️|
    TWO( ____XXXX, X_______, BDY0, BDY1 ),      // 17   |◼️◼️◼️◼️🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____XXXX, X_______, BDY1, BDY1 ),      // 18   |◼️◼️◼️◼️🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____X___, __X_____, BDY1, BDY1 ),      // 19   |◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️|
    TWO( ____XXXX, X_______, BDY2, BDY2 ),      // 20   |◼️◼️◼️◼️🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( _____XXX, X_X_____, BDY2, BDY2 ),      // 21   |◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️🟩◼️◼️◼️◼️◼️|
    TWO( ________, __X_____, BDY2, BDY2 ),      // 22   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️|
    TWO( _____XXX, X_______, HMT1, HMT1 ),      // 23   |◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ________, ________, HMT2, HMT2 ),      // 24   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ______XX, XX______, HMT0, HMT0 ),      // 25   |◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️|
    TWO( _______X, X_______, HMT0, HMT0 ),      // 26   |◼️◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( ______X_, _X______, HMT0, HMT0 ),      // 27   |◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( ______X_, _X______, HMT0, HMT0 ),      // 28   |◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( ______X_, _X______, HMT0, HMT0 ),      // 29   |◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_MINE_UP_1[] = {

    SPRITE_DOUBLE | 24,
    -5,
    0,
                                                //      +---------------------------+
    TWO( _______X, __XXXX__, BONE, HMT0 ),      // 00   |◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩🟩🟩🟩◼️◼️|
    TWO( ______X_, _XXXXXX_, BONE, HMT0 ),      // 01   |◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩🟩🟩🟩🟩🟩◼️|
    TWO( _____X__, _XXXXXX_, BONE, HMT0 ),      // 02   |◼️◼️◼️◼️◼️🟩◼️◼️◼️🟩🟩🟩🟩🟩🟩◼️|
    TWO( _____XX_, XXXXXXXX, BONE, HMT1 ),      // 03   |◼️◼️◼️◼️◼️🟩🟩◼️🟩🟩🟩🟩🟩🟩🟩🟩|
    TWO( ____X_X_, XXXXXXXX, BONE, HMT1 ),      // 04   |◼️◼️◼️◼️🟩◼️🟩◼️🟩🟩🟩🟩🟩🟩🟩🟩|
    TWO( ____X__X, XX_XXXX_, BONE, HMT1 ),      // 05   |◼️◼️◼️◼️🟩◼️◼️🟩🟩🟩◼️🟩🟩🟩🟩◼️|
    TWO( ____X__X, XX_XXXX_, BONE, HMT1 ),      // 06   |◼️◼️◼️◼️🟩◼️◼️🟩🟩🟩◼️🟩🟩🟩🟩◼️|
    TWO( ____X___, XX_XXXX_, BONE, HMT2 ),      // 07   |◼️◼️◼️◼️🟩◼️◼️◼️🟩🟩◼️🟩🟩🟩🟩◼️|
    TWO( ________, XXXXXXXX, HMT2, HMT2 ),      // 08   |◼️◼️◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩🟩🟩|
    TWO( ________, XXXXXXXX, HMT2, HMT2 ),      // 09   |◼️◼️◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩🟩🟩🟩|
    TWO( ________, XXX_____, BDY0, BDY1 ),      // 10   |◼️◼️◼️◼️◼️◼️◼️◼️🟩🟩🟩◼️◼️◼️◼️◼️|
    TWO( ________, _X_XXXX_, BDY0, BDY1 ),      // 11   |◼️◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️🟩🟩🟩🟩◼️|
    TWO( ________, X_XXXXX_, BDY1, BDY1 ),      // 12   |◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️🟩🟩🟩🟩🟩◼️|
    TWO( ________, X_X____X, BDY1, BDY1 ),      // 13   |◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️🟩◼️◼️◼️◼️🟩|
    TWO( ________, XX_XXXXX, BDY0, BDY2 ),      // 14   |◼️◼️◼️◼️◼️◼️◼️◼️🟩🟩◼️🟩🟩🟩🟩🟩|
    TWO( ________, _X_XXXXX, BDY1, BDY2 ),      // 15   |◼️◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️🟩🟩🟩🟩🟩|
    TWO( ________, _X______, BDY2, BDY2 ),      // 16   |◼️◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( ________, ___XXXX_, BDY2, BDY2 ),      // 17   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️|
    TWO( ________, ___XXXX_, BDY2, BDY2 ),      // 18   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩◼️|
    TWO( ________, __X__X__, BDY2, BDY2 ),      // 19   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️🟩◼️◼️|
    TWO( ________, _XXXXX__, BDY2, BDY2 ),      // 20   |◼️◼️◼️◼️◼️◼️◼️◼️◼️🟩🟩🟩🟩🟩◼️◼️|
    TWO( ________, _X_XXX__, HMT1, HMT1 ),      // 21   |◼️◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️🟩🟩🟩◼️◼️|
    TWO( ________, _X___X__, HMT2, HMT2 ),      // 22   |◼️◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️🟩◼️◼️|
    TWO( ________, _____X__, HMT2, HMT2 ),      // 23   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_MINE_DOWN_0[] = {

    SPRITE_DOUBLE | 27,
    3,
    -4,
                                                //      +---------------------------+
    TWO( __XXXX__, ________, HMT0, BONE ),      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXXXX_, ________, HMT0, BONE ),      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXXXX_, ________, HMT0, BONE ),      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XXXXXXXX, ________, HMT0, BONE ),      // 03   |🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XXXXXXXX, ________, HMT1, BONE ),      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XXX___XX, ________, HMT1, BONE ),      // 05   |🟩🟩🟩◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XXXX___X, ________, HMT1, HMT0 ),      // 06   |🟩🟩🟩🟩◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XX_X___X, ________, HMT1, HMT0 ),      // 07   |🟩🟩◼️🟩◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XX_____X, ________, HMT2, HMT0 ),      // 08   |🟩🟩◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XX_____X, ________, HMT2, HMT1 ),      // 09   |🟩🟩◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XX___X_, ________, HMT2, HMT1 ),      // 10   |◼️🟩🟩◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XX___X_, ________, HMT3, HMT1 ),      // 11   |◼️🟩🟩◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __XXXX__, ________, HMT3, HMT2 ),      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ______X_, ________, BDY0, HMT2 ),      // 13   |◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXXXX_, ________, BDY0, HMT2 ),      // 14   |◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXX__XX, ________, BDY1, HMT3 ),      // 15   |◼️🟩🟩🟩◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X_XX__X, ________, BDY1, HMT3 ),      // 16   |◼️🟩◼️🟩🟩◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __X_XXXX, ________, BDY1, BDY1 ),      // 17   |◼️◼️🟩◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___X_XX_, ________, BDY2, BDY1 ),      // 18   |◼️◼️◼️🟩◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __X____X, ___X____, HMT1, BONE ),      // 19   |◼️◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️🟩◼️◼️◼️◼️|
    TWO( _XXXXXXX, X__XX___, HMT1, BONE ),      // 20   |◼️🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️🟩🟩◼️◼️◼️|
    TWO( XX_XXX_X, X__XX___, HMT2, BONE ),      // 21   |🟩🟩◼️🟩🟩🟩◼️🟩🟩◼️◼️🟩🟩◼️◼️◼️|
    TWO( _X______, _X_X____, HMT2, BONE ),      // 22   |◼️🟩◼️◼️◼️◼️◼️◼️◼️🟩◼️🟩◼️◼️◼️◼️|
    TWO( ________, _XX_____, BDY2, BONE ),      // 23   |◼️◼️◼️◼️◼️◼️◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️|
    TWO( ________, __X_____, HMT1, BONE ),      // 24   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️|
    TWO( ________, _X______, HMT2, BONE ),      // 25   |◼️◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️|
    TWO( ________, X_______, HMT0, BONE ),      // 26   |◼️◼️◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️|
                                                //      +---------------------------+
};


const unsigned char shape_FRAME_MINE_DOWN_1[] = {

    SPRITE_DOUBLE | 29,
    3,
    0,
                                                //      +---------------------------+
    TWO( __XXXX__, ________, HMT0, HMT0 ),      // 00   |◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXXXX_, ________, HMT0, HMT0 ),      // 01   |◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXXXX_, ________, HMT0, HMT0 ),      // 02   |◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXXXX_, ________, HMT1, HMT1 ),      // 03   |◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XXXXXXXX, ________, HMT1, HMT1 ),      // 04   |🟩🟩🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XX_X__XX, ________, HMT1, HMT1 ),      // 05   |🟩🟩◼️🟩◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XXX___XX, ________, HMT1, HMT1 ),      // 06   |🟩🟩🟩◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( X_X____X, ________, HMT1, HMT2 ),      // 07   |🟩◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( X______X, ________, HMT1, HMT2 ),      // 08   |🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( X______X, ________, HMT2, HMT2 ),      // 09   |🟩◼️◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X____X_, ________, HMT2, BDY1 ),      // 10   |◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X____X_, ________, HMT2, BDY1 ),      // 11   |◼️🟩◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __XXXX__, ________, HMT2, BDY1 ),      // 12   |◼️◼️🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ________, ________, BDY1, BDY1 ),      // 13   |◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXXXXX_, ________, BDY0, BDY2 ),      // 14   |◼️🟩🟩🟩🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XX___X_, ________, BDY1, BDY2 ),      // 15   |◼️🟩🟩◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __XX_XX_, ________, BDY2, BDY2 ),      // 16   |◼️◼️🟩🟩◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __XX_XX_, ________, BDY2, BDY2 ),      // 17   |◼️◼️🟩🟩◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___X_X__, ________, BDY2, BDY2 ),      // 18   |◼️◼️◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( __X_X_X_, ________, BDY2, BDY2 ),      // 19   |◼️◼️🟩◼️🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( _XXX_XXX, ________, BDY2, BDY2 ),      // 20   |◼️🟩🟩🟩◼️🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( XX_X_X_X, X_______, HMT1, HMT1 ),      // 21   |🟩🟩◼️🟩◼️🟩◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️|
    TWO( _X_____X, ________, HMT2, HMT2 ),      // 22   |◼️🟩◼️◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____X___, ________, BONE, BONE ),      // 23   |◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____X___, ________, BONE, BONE ),      // 24   |◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____X___, ________, BONE, BONE ),      // 25   |◼️◼️◼️◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____XX_X, ________, BONE, BONE ),      // 26   |◼️◼️◼️◼️🟩🟩◼️🟩◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ____XXX_, ________, BONE, BONE ),      // 27   |◼️◼️◼️◼️🟩🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️|
    TWO( ___XX___, ________, BONE, BONE ),      // 28   |◼️◼️◼️🟩🟩◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️|
                                                //      +---------------------------+
};


// clang-format on

const unsigned char *const spriteShape[] = {

    0,                          // 0
    shape_FRAME_STAND,          // 1
    shape_FRAME_ARMS_IN_AIR,    // 2
    shape_FRAME_HUNCH,          // 3
    shape_FRAME_PUSH,           // 4
    shape_FRAME_PUSH2,          // 5
    shape_FRAME_WALK1,          // 6
    shape_FRAME_WALK2,          // 7
    shape_FRAME_WALK3,          // 8
    shape_FRAME_WALK4,          // 9
    shape_FRAME_SKELETON1,      // 10
    shape_FRAME_SKELETON2,      // 11
    shape_FRAME_SKELETON3,      // 12
    shape_FRAME_SKELETON4,      // 13
    shape_FRAME_SKELETON5,      // 14
    shape_FRAME_WALKUP0,        // 15
    shape_FRAME_WALKUP1,        // 16
    shape_FRAME_WALKUP2,        // 17
    shape_FRAME_WALKUP3,        // 18
    shape_FRAME_WALKDOWN0,      // 19
    shape_FRAME_WALKDOWN1,      // 20
    shape_FRAME_WALKDOWN2,      // 21
    shape_FRAME_WALKDOWN3,      // 22
    shape_FRAME_MINE_UP_0,      // 23
    shape_FRAME_MINE_UP_1,      // 24
    shape_FRAME_MINE_DOWN_0,    // 25
    shape_FRAME_MINE_DOWN_1,    // 26
    shape_FRAME_02,             // 27
    shape_FRAME_03,             // 28
    shape_FRAME_05,             // 29
    shape_FRAME_06,             // 30
    shape_FRAME_07,             // 31
    shape_FRAME_08,             // 32
    shape_FRAME_09,             // 33
    shape_FRAME_10,             // 34
    shape_FRAME_11,             // 35
    shape_FRAME_12,             // 36
    shape_FRAME_13,             // 37
    shape_FRAME_14,             // 38
    shape_FRAME_15,             // 39
    shape_FRAME_16,             // 40
    shape_FRAME_17,             // 41
    shape_FRAME_18,             // 42
    shape_FRAME_19,             // 43
    shape_FRAME_20,             // 44
    shape_FRAME_21,             // 45
    shape_FRAME_22,             // 46
    shape_FRAME_23,             // 47
    shape_FRAME_24,             // 48
    shape_FRAME_25,             // 49
    shape_FRAME_26,             // 50
    shape_FRAME_27,             // 51
    shape_FRAME_28,             // 52
    shape_FRAME_29,             // 53
    shape_FRAME_30,             // 54
    shape_FRAME_31,             // 55
    shape_FRAME_32,             // 56
    shape_FRAME_33,             // 57
    shape_FRAME_34,             // 58
    shape_FRAME_35,             // 59
    shape_FRAME_36,             // 60
    shape_FRAME_37,             // 61
    shape_FRAME_38,             // 62
    shape_FRAME_39,             // 63
    shape_FRAME_40,             // 64
    shape_FRAME_41,             // 65
    shape_FRAME_42,             // 66
    shape_FRAME_44,             // 67
    shape_FRAME_45,             // 68
    shape_FRAME_46,             // 69
    shape_FRAME_47,             // 70
    shape_FRAME_48,             // 71
    shape_FRAME_49,             // 72
    shape_FRAME_50,             // 73
    shape_FRAME_51,             // 74
};

_Static_assert(sizeof(spriteShape) / sizeof(spriteShape[0]) == FRAME_MAX, "spriteShape table wrong size");

// EOF
